[
   {
      "article_url": "https://www.apprenticeshipsdirectory.com/blog/i%E2%80%99ve-employed-an-apprentice%E2%80%A6now-what",
      "article_title": "I’ve Employed An Apprentice…Now What?",
      "article_title_generate": "I’VE EMPLOYED AN APPRENTICE…NOW WHAT?",
      "article_publisher": "Apprenticeships Directory (Weblog)",
      "article_text": "Embarking on the apprenticeship journey offers a multitude of benefits for businesses, a subject we’ve previously explored in Ten compelling reasons to integrate apprenticeships into your business strategy. However, initiating this venture often raises numerous questions for employers, including the intricacies of apprenticeship contracts, appropriate salary benchmarks, and holiday entitlements. This guide is designed to address these queries and provide you with some top tips to ensure a successful start to your apprenticeship programme with CMS Vocational Training Ltd.\n\nENSURING APPROPRIATE COMPENSATION AND CONTRACTUAL OBLIGATIONS\n\nA primary concern for employers is to comply with the legal minimum wage requirements for apprentices, which may be lower than the standard national minimum wage. This obligation integrates smoothly into standard payroll processes, with the added benefit that apprentices may qualify for National Insurance contribution exemptions under certain circumstances. For comprehensive guidelines, please refer to the UK Government National Minimum Wage Rates.\n\nCMS would encourage employers to consider offering compensation that exceeds the minimum requirements, including potential bonuses or commissions, to enhance motivation and express appreciation for the apprentice’s contributions.\n\nLEVERAGING FINANCIAL SUPPORT: NAVIGATING GRANTS AND FUNDING\n\nThe financial implications of hiring an apprentice are mitigated by available grants, a topic detailed in Apprenticeships: Funding for Employers. Should you require assistance with determining eligibility or navigating the application process, our team is available for consultation. Contact us at 01924 470477, email info@cmsvoc.co.uk or explore further at Apprenticeship Funding.\n\nCLARIFYING EMPLOYMENT RIGHTS: HOURS AND ENTITLEMENTS\n\nIt is essential to present apprentices with a contract of employment that guarantees the same holiday entitlement as other employees. Standard working hours for apprentices range from 30 to 40 hours per week, with provisions for additional training and assessment. For employees transitioning to an apprenticeship role, it is standard practice for their wages to remain constant, albeit with the advantage of acquiring qualifications at no additional expense.\n\nDETERMINING THE DURATION OF APPRENTICESHIP COMMITMENTS\n\nThe length of an apprenticeship can vary, necessitating a commitment of at least one year (and seven days), with the possibility of extension up to four years for higher-level apprenticeships. This duration should be customised to suit both the employer’s operational needs and the apprentice’s vocational aspirations.\n\nMANAGING THE APPRENTICESHIP EXPERIENCE: FROM CHALLENGES TO SUCCESS\n\nIdentifying and nurturing potential within apprentices allows for strategic planning for their career progression post-apprenticeship, whether through further training or a transition to full-time employment. Encountering challenges is a part of the process, wherein the support of a reputable training provider is invaluable, ensuring any issues are addressed promptly and effectively.\n\nPOST-APPRENTICESHIP: ADVANCING CAREER DEVELOPMENT\n\nWhile there is no obligation to offer permanent positions upon completion of an apprenticeship, it is a practice many employers adopt, valuing the investment in a well-trained, dedicated individual who is already integrated into the company culture. Offering further training opportunities within the organization can also be beneficial, supporting ongoing professional development.\n\nINITIATING YOUR APPRENTICESHIP PROGRAMME\n\nFor those considering the implementation of an apprenticeship program or seeking detailed information on specific apprenticeship pathways, such as HR, Learning and Development, Leadership and Management, Business Administration, Customer Service, or Health & Fitness, please contact us at 01924 470477 or via email at info@cmsvoc.co.uk.",
      "article_summary": "However, initiating this venture often raises numerous questions for employers, including the intricacies of apprenticeship contracts, appropriate salary benchmarks, and holiday entitlements.\nENSURING APPROPRIATE COMPENSATION AND CONTRACTUAL OBLIGATIONSA primary concern for employers is to comply with the legal minimum wage requirements for apprentices, which may be lower than the standard national minimum wage.\nFor comprehensive guidelines, please refer to the UK Government National Minimum Wage Rates.\nCLARIFYING EMPLOYMENT RIGHTS: HOURS AND ENTITLEMENTSIt is essential to present apprentices with a contract of employment that guarantees the same holiday entitlement as other employees.\nStandard working hours for apprentices range from 30 to 40 hours per week, with provisions for additional training and assessment.",
      "article_keywords": [
         "apprentices",
         "apprenticeship",
         "minimum",
         "hours",
         "national",
         "employed",
         "employment",
         "wage",
         "apprenticenow",
         "ive",
         "employers",
         "training",
         "standard"
      ]
   },
   {
      "article_url": "https://oilprice.com/Energy/Natural-Gas/An-EU-Carbon-Tax-Will-Upend-The-Global-LNG-Market.html",
      "article_title": "An EU Carbon Tax Will Upend The Global LNG Market",
      "article_title_generate": "An EU Carbon Tax Will Upend The Global LNG Market",
      "article_publisher": "OilPrice.com",
      "article_text": "The global LNG market could face a sea change in prices and trade flows later this decade if the European Union includes LNG in its carbon border tax.\n\nThe EU’s Carbon Border Adjustment Mechanism (CBAM), commonly known as the “carbon border tax,” was launched on October 1 in the first transitional phase for imports of several carbon-intensive groups of products into the European Union.\n\nThe first phase of the EU’s carbon import pricing legislation will not impose levies on the products—such will apply from 2026. However, importers of iron and steel, cement, aluminum, fertilizer, hydrogen, and electricity into the EU will be asked—as of now—to report on the volume of their imports and the greenhouse gas (GHG) emissions embedded during their production, although they will not be paying any financial adjustment at this stage.\n\nLNG is currently left out of the carbon border tax, so imports are not being additionally taxed right now.\n\nBut, the EU has extended its Emission Trading Scheme (ETS) to shipping, which means that LNG cargoes into Europe will be subject to a carbon tax from 2024.\n\n“For now, the first draft only refers to new LNG import contracts, but a methane tax on all LNG imports exceeding defined limits cannot be ruled out,” Wood Mackenzie analysts wrote in a report this week.\n\nThe EU could go further and include LNG in CBAM, setting an import duty at prevailing carbon prices in ETS, WoodMac noted. Related: Why Do we Still Have Investor-Owned Utilities?\n\nIf the bloc were to include LNG in the carbon border tax mechanism, the LNG market would be split into two and become a two-tier market of premium prices in Europe and lower prices in emerging Asian markets, the energy consultancy says in its analysis.\n\nNow, there is a big ‘if’ in these assumptions. The EU, which currently relies a lot on LNG imports for its natural gas supply – Russian pipeline gas being mostly out of the picture – could still need relatively high LNG volumes after 2026 and may not opt for an LNG import duty that is sure to upend global markets.\n\nIt remains to be seen how Europe will juggle its emission reduction targets with energy security.\n\n“If the EU decides to apply these levies, then this will push European gas prices up but also bifurcate the global LNG market, creating a two-tier LNG market,” said Massimo Di Odoardo, Vice President of Gas & LNG Research at Wood Mackenzie.\n\nThis may not play to Europe’s advantage because LNG exporters with the lowest emissions will benefit the most, but market proximity will be key, including for one of the top exporters, Qatar, which is planning a massive expansion in its export capacity by the end of the decade.\n\nAccording to WoodMac, Qatar and Mozambique, for example, will require high carbon prices in Europe that could lure them away from closer markets in emerging Asia, which are unlikely to introduce an import tax on emissions and which—unlike Europe—are only set to see their demand for LNG rise in the coming years.\n\nOn the other hand, the U.S. has some of the world’s highest-emitting LNG projects, with upstream reservoir type and pipeline distance to LNG plants adding to their high methane intensity, per WoodMac’s estimates.\n\nU.S. LNG projects will likely be motivated to act to reduce emissions.\n\nHowever, the scale and extent of future emissions taxes on LNG imports will be critical to reduce emissions in the LNG industry at scale, according to Wood Mackenzie.\n\nADVERTISEMENT\n\nIf only Europe imposed taxes, it would not achieve the required goal of large-scale decarbonization of LNG projects globally, the constancy notes. The most likely result will be a bifurcate LNG market instead.\n\n“If there is to be any material impact, a carbon price closer to US$200/t CO2e will be required for LNG imports,” Di Odoardo said.\n\n“Additionally, this would have to be introduced on a global level for it to be truly effective in reducing carbon intensity and that is unlikely to happen. For now, all eyes will be on Europe to see what it does next.”\n\nBy Tsvetana Paraskova for Oilprice.com\n\nMore Top Reads From Oilprice.com:",
      "article_summary": "The global LNG market could face a sea change in prices and trade flows later this decade if the European Union includes LNG in its carbon border tax.\nThe first phase of the EU’s carbon import pricing legislation will not impose levies on the products—such will apply from 2026.\nLNG is currently left out of the carbon border tax, so imports are not being additionally taxed right now.\nThe EU could go further and include LNG in CBAM, setting an import duty at prevailing carbon prices in ETS, WoodMac noted.\n“If the EU decides to apply these levies, then this will push European gas prices up but also bifurcate the global LNG market, creating a two-tier LNG market,” said Massimo Di Odoardo, Vice President of Gas & LNG Research at Wood Mackenzie.",
      "article_keywords": [
         "tax",
         "import",
         "global",
         "gas",
         "europe",
         "prices",
         "upend",
         "lng",
         "eu",
         "carbon",
         "imports",
         "market"
      ]
   },
   {
      "article_url": "https://aviationsourcenews.com/emergency/pia-777-lahore-toronto-diverts-to-bodo-emergency-onboard/",
      "article_title": "PIA 777 Lahore-Toronto Diverts to Bodo: Emergency Onboard",
      "article_title_generate": "PIA 777 Lahore-Toronto Diverts to Bodo: Emergency Onboard",
      "article_publisher": "AviationSource",
      "article_text": "In the last few moments, a Pakistan International Airlines (PIA) Boeing 777 operating a flight between Lahore & Toronto diverted to Bodo due to an emergency onboard.\n\nThe cause for the emergency onboard has been revealed, but here is what we know so far.\n\nWithout further ado, let’s get into it…\n\nPK797 – Lahore-Toronto: Bodo Diversion…\n\nData provided by RadarBox.com.\n\nBriYYZ from Toronto, Canada, CC BY-SA 2.0 https://creativecommons.org/licenses/by-sa/2.0, via Wikimedia Commons\n\nPIA flight PK797 is a routine scheduled flight between Lahore and Toronto.\n\nThe aircraft involved in the emergency diversion to Bodo is AP-BGY.\n\nAs per data from Planespotters.net, AP-BGY is a 19.1 year old Boeing 777-200LR aircraft.\n\nIt was delivered to PIA back in February 2006, and was one of the testbeds for Boeing at the time.\n\nFurthermore, of the 777-200 variant, the airline has eight of them in the fleet, of which seven are in active service.\n\nAverage fleet age for the variant is at 19.1 years.\n\nPIA flight PK797 departed Lahore at 1725 local time this afternoon and initially proceeded to Toronto.\n\nAfter tracking far north and out of radar coverage, the aircraft re-entered said coverage heading directly south.\n\nShortly after that, the aircraft started descending, with the diversion field of Bodo chosen for this emergency.\n\nIt is understood that PK797 between Lahore and Toronto landed safely without incident into Bodo.\n\nMedical-Related Incident…\n\nVenkat Mangudi via Wikimedia Commons.\n\nPakistan airlines flight PK797 is diverting to Bodo due to medical emergency\n\n\n\n⁦@RadarBoxCom⁩\n\n\n\nFollow flight PK797 at RadarBox https://t.co/f8jRouJB1S pic.twitter.com/wahzegLjaO — Flight Emergency (@FlightEmergency) March 24, 2024\n\n@FlightEmergency on X confirmed that the reason for the diversion was due to a medical emergency onboard.\n\nFurthermore, it can be assumed that the PIA aircraft, which originally came from Lahore, will continue on to Toronto from Bodo tonight.\n\nThis depends on whether the crew has the hours needed to make that hop across the Atlantic from Bodo.\n\nThere are no specifics regarding the condition of the affected passengers, with this not being disclosed at any time by AviationSource.\n\nBut for now, all eyes will be on when it departs Bodo to continue on to Toronto.\n\nDid you know AviationSource has two newsletters? One covers the general news and analysis of the industry as a whole, and the other to do with emergencies that take place throughout the year! To subscribe to our General News Newsletter, CLICK HERE!\n\nTo subscribe to our Emergencies, Accidents & Incidents Newsletter, CLICK HERE!\n\nClick the photo to join our WhatsApp channel so then you can stay up to date with everything going on in the aviation industry!",
      "article_summary": "In the last few moments, a Pakistan International Airlines (PIA) Boeing 777 operating a flight between Lahore & Toronto diverted to Bodo due to an emergency onboard.\nBriYYZ from Toronto, Canada, CC BY-SA 2.0 https://creativecommons.org/licenses/by-sa/2.0, via Wikimedia CommonsPIA flight PK797 is a routine scheduled flight between Lahore and Toronto.\nThe aircraft involved in the emergency diversion to Bodo is AP-BGY.\nPIA flight PK797 departed Lahore at 1725 local time this afternoon and initially proceeded to Toronto.\nFurthermore, it can be assumed that the PIA aircraft, which originally came from Lahore, will continue on to Toronto from Bodo tonight.",
      "article_keywords": [
         "boeing",
         "diverts",
         "lahore",
         "onboard",
         "toronto",
         "diversion",
         "pk797",
         "bodo",
         "lahoretoronto",
         "777",
         "flight",
         "pia",
         "aircraft",
         "emergency"
      ]
   },
   {
      "article_url": "https://businessplus.ie/sme/corkbic-axisbic-expands/",
      "article_title": "CorkBIC rebrands as AxisBIC and expands its reach",
      "article_title_generate": "CorkBIC rebrands as AxisBIC and expands its reach",
      "article_publisher": "Business Plus Online",
      "article_text": "CorkBIC, which has been active in the South West for 35 years, has rebranded and expanded the footprint of its service offering.\n\nUnder the new AxisBIC name, the organisation will expand to offer services to start-ups in Limerick and Clare.\n\nAxisBIC is one of four BICs funded by Enterprise Ireland to grow and support innovative startups who have high growth potential and can contribute to economic development in their areas.\n\nAxisBIC advisers assist entrepreneurs to develop a business plan, raise investment, manage business propositions, and arrange agreements with shareholders and investors.\n\nThe organisation said it has has an extensive network of partners including local authorities, universities, investors, business bodies and seasoned entrepreneurs across Ireland and internationally.\n\nBusiness Bulletin\n\nCorkBIC’s clients in the past have included Catalyx, Workvivo, Poppulo, Abtran, Green Saffron, and AventaMed.\n\nLarry O’Donoghue, CEO of AxisBIC, commented: “We have been working with innovative entrepreneurs and providing support and essential business expertise to hundreds of start-ups in Cork and Kerry over the last 35 years.\n\n“We are excited to develop and grow these collaborations with entrepreneurs in Clare and Limerick. I would like to recognise all the support that we’ve received from our partners, many of whom are at this event today, as we launch the next phase of our journey as CorkBIC becomes AxisBIC.”\n\nCatalyx founder Frank Madden said CorkBIC offered “invaluable support” to the venture.\n\n“Starting a new business can be an extremely daunting experience but the team at CorkBIC helped us to navigate the many challenges we faced and were a huge part of our success. I would highly recommend any start-up or entrepreneur to contact them for advice and assistance,” said Madden.\n\nEnterprise minister Simon Coveney stated: “This expansion is a great reflection of AxisBIC’s commitment and dedication to its clients and their development, and I support the endeavours of AxisBIC as they help to develop innovative entrepreneurs across the South and Mid-West region.”\n\nAxisBIC is a member of the European Business and Innovation Centre Network and a founding member of HBAN, the Halo Business Angel Network.\n\nSimon Coveney stated: “This expansion is a great reflection of AxisBIC’s commitment and dedication to its clients and their development\". Pic: Orla Murray/Coalesce\n\nThe BIC managed HBAN in the South & Mid-West for 17 years, finishing in 2022 with over €33m of angel Investment into high growth start-ups, and continues to run the Boole Investment Syndicate based out of Cork.\n\nAxisBIC said initiatives like the Entrepreneur Experience and the Venture Academy have assisted over 300 companies to raise funding over the past decade.\n\nPhoto: Larry O'Donoghue, CEO, AxisBIC; Aidan O'Driscoll, AxisBIC, Limerick and Fionnuala Wall, AxisBIC. Pic: John Allen",
      "article_summary": "CorkBIC, which has been active in the South West for 35 years, has rebranded and expanded the footprint of its service offering.\nUnder the new AxisBIC name, the organisation will expand to offer services to start-ups in Limerick and Clare.\nAxisBIC is one of four BICs funded by Enterprise Ireland to grow and support innovative startups who have high growth potential and can contribute to economic development in their areas.\nAxisBIC advisers assist entrepreneurs to develop a business plan, raise investment, manage business propositions, and arrange agreements with shareholders and investors.\nPhoto: Larry O'Donoghue, CEO, AxisBIC; Aidan O'Driscoll, AxisBIC, Limerick and Fionnuala Wall, AxisBIC.",
      "article_keywords": [
         "axisbic",
         "innovative",
         "investment",
         "rebrands",
         "expands",
         "south",
         "corkbic",
         "limerick",
         "reach",
         "entrepreneurs",
         "business",
         "startups",
         "support"
      ]
   },
   {
      "article_url": "https://businessplus.ie/motoring/mazda2-is-comfortable-solid-and-sprightly/",
      "article_title": "Mazda2 is comfortable, solid and sprightly",
      "article_title_generate": "Mazda2 is comfortable, solid and sprightly",
      "article_publisher": "Business Plus Online",
      "article_text": "The first time I went to Barcelona was on a school tour in 1978. I turned 15 half way through the fortnight away, and that's an age at which a place can leave a lasting impression; I still love it and the surrounding area.\n\nIn the years since, I have been back many times, but usually only to the beach resorts in Catalunya. That's why it was a pleasure to explore the hinterland in a bit more depth, this time in the latest Mazda2 Hybrid.\n\nWe were based in Calafell, about an hour south of Barcelona, and the driving route first took me into Tarragona, where massive yachts, some seized from Russian oligarchs as part of the Ukraine war sanctions, dot the harbour.\n\nThe real fun came afterwards, though. Once away from the urban streets and the motorway, you enter the real Catalunya, a landscape of jagged mountain peaks, and endless vineyards basking under relentless sun.\n\nMy test car was the top-of-the-range Mazda2 Homura Plus variant, which comes with a sunroof, all the better to see that lovely sky. The car is a joint venture with Toyota, so there's the unmistakeable feel of the Yaris about it, though both are equally pretty in the metal.\n\nBusiness Bulletin\n\nThat means there's a certain familiarity about the 1.5-litre petrol engine matched with a 59kW electric motor and a continuous variable transmission (CVT).\n\nI've never been wild about CVTs, because they often feel a little bit wheezy even on relatively unchallenging gradients, but the Mazda2 leapt up the hills if not quite like a gazelle, then certainly like a mountain goat.\n\nOn the straights, it felt solid, despite a sub-4m length, and where that matters is in the assured handling, not just on the country roads but on the motorways too, where outside noise was no match for the good insulation. This is a very quiet car when you're touring.\n\nIrish pricing has yet to be announced, but expect an entry-level model to cost around €28,000, with Homura Plus more expensive. To the basic spec, it adds a 10.5-inch infotainment display, compared with 9-inch basic, a 12.3-inch digital instrument screen, satnav, head-up display, and voice recognition.\n\nYou also get 17-inch wheels, over the 15-inch on the standard model, and that sunroof.\n\nThere are four grades - Centre-Line, Exclusive-Line, Homura and Homura Plus - and, depending on which one you opt for, you'll get the likes of keyless entry, parking sensors, wireless phone charging and so on.\n\nAll variants come with air conditioning, lane-keeping assist, adaptive cruise control, traffic sign recognition, speed assistance, emergency steering assist, and so on. It's a very comprehensive safety package.\n\nAs for looks, well, Mazda always does the business for me in that department, and here it's done enough to make it look different to the Yaris, no matter how marginally.\n\nYou get a distinctive Mazda grille, cats-eye headlights, and a nicely weighted balance between front and rear.\n\nThe large hatchback reveals a cargo space that feels more generous than the advertised 286 litres - 935 with the rear bench folded - and while passenger legroom is just about fine for tall people, the width is more suited to two adults than three.\n\nAt 97g/km, emissions are low enough to attract annual motor tax of just €170, while fuel consumption of 4.2 litres per 100km is not going to break anyone's bank.\n\nThis also is a very comfortable car. I spent a solid three-and-a-half hours tootling around all sorts of roads and surfaces, and never once felt a sharp jolt, or felt tired behind the wheel.\n\nClassy cloth upholstery helps, and the unfussy fascia feels like everything is where it should be.\n\nMy only regret is that I stopped for a coffee at one stage, at a restaurant with a terrace overlooking vineyards and at the mountain in the distance. There was a lovely bit of heat, even in March, and the sound of birdsong everywhere.\n\nAs it happened, the restaurant was closed, but I sat on the terrace for ten minutes anyway, contemplating what it would be like to wander up here in the afternoon during retirement, sip a lazy glass of one of the local vintages and just watch the world go by.\n\nAt all other times of the day, I certainly would be happy to be back in the Mazda2.\n\nIt's a lovely piece of kit, and certainly should be on your shopping list if you too are thinking of downsizing.\n\nMAZDA2 HYBRID\n\nPRICE TBC\n\nMODEL DRIVEN Homura Plus trim\n\nENGINE 1.5-litre petrol hybrid/59kW electric motor\n\nMAX COMBINED POWER 114hp\n\nTRANSMISSION CVT\n\n0-100KM/H 9.7 seconds\n\nTOP SPEED 175kph\n\nFUEL CONSUMPTION 4.2L/100km\n\nEMISSIONS 97g/km €170 tax",
      "article_summary": "That's why it was a pleasure to explore the hinterland in a bit more depth, this time in the latest Mazda2 Hybrid.\nMy test car was the top-of-the-range Mazda2 Homura Plus variant, which comes with a sunroof, all the better to see that lovely sky.\nIrish pricing has yet to be announced, but expect an entry-level model to cost around €28,000, with Homura Plus more expensive.\nThere was a lovely bit of heat, even in March, and the sound of birdsong everywhere.\nMAZDA2 HYBRIDPRICE TBCMODEL DRIVEN Homura Plus trimENGINE 1.5-litre petrol hybrid/59kW electric motorMAX COMBINED POWER 114hpTRANSMISSION CVT0-100KM/H 9.7 secondsTOP SPEED 175kphFUEL CONSUMPTION 4.2L/100kmEMISSIONS 97g/km €170 tax",
      "article_keywords": [
         "solid",
         "comfortable",
         "car",
         "certainly",
         "mazda2",
         "mountain",
         "felt",
         "bit",
         "yaris",
         "lovely",
         "plus",
         "sprightly",
         "homura"
      ]
   },
   {
      "article_url": "https://businessplus.ie/industry-type/sustainability/plastrak-smes/",
      "article_title": "PlasTrak helps SMEs with sustainability reporting",
      "article_title_generate": "PlasTrak helps SMEs with sustainability reporting",
      "article_publisher": "Business Plus Online",
      "article_text": "TCD business students and Cognition World have developed a simple online toolkit to assist SMEs in measuring plastic and waste management.\n\nThe initiative ties in with the EU's voluntary sustainability reporting standards.\n\nPlasTrak was set up by a group of final-year business students from Trinity College, who partnered with sustainability-tech company Cognition World.\n\nFinn Howley, partner lead at PlasTrak, commented: “Inspired by our journey with five pioneering SMEs, we're excited to offer practical insights and guidance tailored to the challenges of CSRD compliance.\n\n“From deciphering complex requirements to seizing opportunities for innovation and community engagement, our platform is here to support SMEs every step of the way.”\n\nBusiness Bulletin\n\nThomas McGrath, CEO at Cognition World, stated: “Helping the huge cohort of SMEs to cost-effectively embrace sustainability management practices needs to start now, and I welcome user-led initiatives like PlasTrak.\n\n“The Irish sustainability-tech industry will rise to the challenge and is constantly innovating to develop a suite of cost-effective solutions to help SMEs to better collect and use data to help them improve their reporting and sustainability management.”\n\nCognition World’s sustainability management analytics platform enables SMEs to view in real-time, or report periodically, on how their utilities, environmental and machine data perform in order to reduce unnecessary operational waste to improve ESG reporting.\n\nPhoto: Students Finn Howley (right) and Robert McGovern with Thomas McGrath",
      "article_summary": "TCD business students and Cognition World have developed a simple online toolkit to assist SMEs in measuring plastic and waste management.\nThe initiative ties in with the EU's voluntary sustainability reporting standards.\nPlasTrak was set up by a group of final-year business students from Trinity College, who partnered with sustainability-tech company Cognition World.\nFinn Howley, partner lead at PlasTrak, commented: “Inspired by our journey with five pioneering SMEs, we're excited to offer practical insights and guidance tailored to the challenges of CSRD compliance.\n“From deciphering complex requirements to seizing opportunities for innovation and community engagement, our platform is here to support SMEs every step of the way.”Business BulletinThomas McGrath, CEO at Cognition World, stated: “Helping the huge cohort of SMEs to cost-effectively embrace sustainability management practices needs to start now, and I welcome user-led initiatives like PlasTrak.",
      "article_keywords": [
         "smes",
         "helps",
         "sustainability",
         "reporting",
         "students",
         "platform",
         "mcgrath",
         "plastrak",
         "waste",
         "sustainabilitytech",
         "world",
         "cognition"
      ]
   },
   {
      "article_url": "https://www.nakedcapitalism.com/2024/03/covid_roundup_covidisairborne_npis_sequelae_immune_dysregulation_social_norming_official_maleficence_eugenics_and_more.html",
      "article_title": "Princess Kate’s cancer treatment news sparks remorse from people who spread conspiracies and memes online",
      "article_title_generate": "Covid Roundup: #CovidIsAirborne, NPIs, Sequelae, Immune Dysregulation, Social Norming, Official Maleficence, Eugenics (and More)",
      "article_publisher": "naked capitalism",
      "article_text": "By Lambert Strether of Corrente.\n\nPatient readers, I am buffeted by two enormous firehoses of information: the 2024 election, and Covid. While I do try to present the most important Covid information, there’s so much of it just now that important material gets left on the cutting room floor. So think of this post as my “director’s cut” on Covid; the three-and-a-half hour version as opposed to the ninety-minute one that made it into the theatres. (I went through the links from trusted sources I’d flagged to read since March 1 (!), and opened up about 200 tabs, so even the verbose post you are about to read is selective.)\n\nBefore I begin: (1) Covid is not “over”; mass infection from the pandemic continues. (2) Covid is airborne. If you’re feeling the urge right now to dispute either proposition in comments, let me advise you: don’t.\n\nWhat follows is a compendium of worthwhile material I simply haven’t been able to get to, grouped into the following categories: #CovidIsAirborne, Non-Pharmaceutical Interventions (NPIs), Testing, Sequelae, Immune Dysregulation, Children, Social Norming, Gaslighting, Official Maleficence, and Eugenics. Feel free to skip to the category most interesting to you!\n\n* * *\n\n#CovidIsAirborne\n\n“Bus Riding as Amplification Mechanism for SARS-CoV-2 Transmission, Germany, 2021” [Emerging Infectious Diseases, CDC]. From the Abstract: “A phylogenetically unique strain and epidemiologic analyses provided a link between air travelers and cases among bus company staff, schoolchildren, other bus passengers, and their respective household members. The attack rate among bus-riding children at 1 school was ≈4 times higher than among children not taking a bus to that school. The outbreak exemplifies how an airborne agent may be transmitted effectively through (multiple) short (<20 minutes) public transport journeys and may rapidly affect many persons.” • More on the quarantine-breaking driver from CIDRAP here. The first epidemiogical study on airborne tranmssion that I spotted was also from a bus, in March 2020 (from the South China Morning Post, complete with seating chart). Which would make the CDC about — [allow me to break out my calculator] — 2024 – 2020 = 4 years late. Still, it’s always good to add to the literature!\n\n“COVID-19 outbreak at a residential apartment building in Northern Ontario, Canada” (accepted manuscript) [Epidemiology and Infection]. “A case-control study examined building-specific exposures and resident behaviours that may have increased the odds of being a case. A professional engineer assessed the building’s heating, ventilation, and air conditioning systems. Whole genome sequencing and an in-depth genomic analysis were performed. Forty-five outbreak confirmed cases were identified. From the case-control study, being on the upper floors (OR: 10.4; 95% CI: 1.63-66.9) or within three adjacent vertical lines (OR: 28.3; 3.57-225) were both significantly associated with being a case of COVID-19, after adjusting for age. There were no significant differences in reported behaviours, use of shared spaces, or precautions taken between cases and controls. Assessment of the building’s ventilation found uncontrolled air leakage between apartment units. A single genomic cluster was identified, where most sequences were identical to one another. Findings from the multiple components of this investigation are suggestive of aerosol transmission between units.” • Amoy Gardens all over again.\n\n“Molecular detection of SARS-CoV-2 and other respiratory viruses in saliva and classroom air: a two winters tale” [Clinical Microbiology and Infection]. From the Abstract: “We analyze saliva, air, and air cleaner filter samples from studies conducted in two Swiss secondary schools (age 14-17 years) over seven weeks during the winters of 2021/22 and 2022/23. Two bioaerosol sampling devices and HEPA filters from air cleaners were used to collect airborne virus particles in five classrooms…. The weekly probability of airborne detection was 34%… for SARS-CoV-2 and 10%… for other respiratory viruses. There was a distinct shift in the distribution of respiratory viruses from SARS-CoV-2 during the Omicron wave to other respiratory viruses one year later. SARS-CoV-2 is more likely to be detected in the air than other endemic respiratory viruses, possibly reflecting differences in viral characteristics and the composition of virus-carrying particles that facilitate airborne long-range transmission.”\n\nIf only SARS-CoV-2 were visible:\n\n1️⃣ Last Monday, my family was briefly exposed to a symptomatic person who had tested negative on a RAT. When I realized they were symptomatic, I asked them to leave as a precaution, and immediately refreshed the air via doors and windows open. They tested + the next day. 2/ — C Pita 🇺🇦🌻 (@CPita3) December 28, 2021\n\n“Insurance Case Hinges on Whether Covid Virus Damages Property” [Bloomberg]. “Chubb Limited-owned Vigilant Insurance Co. argues because ‘the mere temporary presence of an easily removed foreign substance—a water spill, a wafting odor, or microscopic aerosolized droplets—does not distinctly and demonstrably alter the property itself, it does not qualify as direct physical damage or loss under the plain policy language implemented in California’s longstanding’ standard. ‘Our policy doesn’t include [treating] property as air,’ said Vigilant attorney Jonathan D. Hacker with O’Melveny & Myers LLP. ‘It’s not even insurable property.'” • Oh.\n\nNPIs: Ventilation and Filtration\n\n“Ventilation Can Reduce Exposure to Respiratory Viruses in Indoor Spaces” [National Center for Immunization and Respiratory Diseases, CDC]. “Good ventilation can help safeguard our health by reducing our exposure to respiratory viruses. People can still get sick after ventilating a space, so it is important to use ventilation as one part of a multi-layered approach to protect ourselves against getting sick from respiratory viruses…. Respiratory viruses primarily spread in the air between people. The fewer viruses in the air, the better . Improving ventilation can help you reduce virus levels in your home and reduce the chances that the virus will spread.” • Better late than never. Commentary:\n\nMore genius from this account… https://t.co/2YDI2PVgDe — Michael R. Hicks, COVID Dissident (@Michael59503746) March 23, 2024\n\nMaybe CDC’s HICPAC should read this.\n\n“Ventilation Should Be A Larger Focus In Our Fight Against Covid-19” [Judy Stone, Forbes]. A good roundup, including this: “Richard Corsi, co-inventor with Jim Rosenthal of the Corsi-Rosenthal box, a DIY air filter, and now dean of engineering at the University of California Davis, also helped address the issue of cost and benefits with figures that are easier to relate to. Corsi said, “We could put a CR Box in EVERY public school classroom in the United States at a cost of $160M/year. That’s less than one Venti American coffee per student per year (or 0.024% of the average cost of educating a child each year in the US). In doing this calculation I have used a bulk discount for filters, which lowers the cost of a CR box by about 35%. We could do the same with HEPA air cleaners at about twice the price – 1 Grande Mocha Cookie Crumble Frappuccino per student per year.” He estimated the costs would be a bit higher for offices but still relatively low cost, given improved employee performance. The best thing we can do to reduce risk? Let in fresh air.'” • On CR boxes, see NC here and here.\n\nNPIs: Masking\n\nAlert reader Propertius writes:\n\nI’m still masking everywhere, too. It’s not a matter of “fear of getting COVID again” because I’ve *never* had it. Not once, even though most of my friends and acquaintances are on their third or fourth cases. I haven’t gotten anything else since January, 2020, either. Four years with no COVID, no influenza, no colds. Being sick is a really miserable experience and I’m delighted I haven’t gone through that since the pandemic first began. It’s not a matter of “fear”. Instead, it’s a matter of simple joy in not being ill. In my view, risking easily avoidable illness isn’t “brave”, it’s just stupid.\n\n“San Antonio hospital could have an answer to the PPE crisis– elastomeric masks” [KENS5]. From 2020, but ever green. “‘We are the only center in the U.S. which uses elastomeric masks routinely,’ [Medical Director] Dr. Annie Kizilbash said… She says the Elastomeric North 7700 Respirator is Hypoallergenic and made 100 percent of silicon and the center has 130 of these masks being routinely used…. The hospital specializes in treating tuberculosis patients. Dr. Kizilbash says the Elastomeric is highly effective against airborne diseases such as Tuberculosis. She says the center has used them since 1996 and not once did an employee test positive for TB . ‘They use P100 filters. What that means is that they’re oil proof and the 100 part means they’re 99.97% effective against airborne particles which is more so than the N95 which is 95% effective.'” • Today being World Tuberculosis Day.\n\n“Why wear a mask to a protest?” [The Gauntlet]. This concept is, apparently, controversial in some large fraction of the putative left. The deck says it all. “Why spread illness when you could not do that?”\n\nMasks as fashion items (a hobby-horse of mine):\n\nMy source is Mask Lab in the US! https://t.co/kcvw4DGV7Z — Abby du Nord (@abbyobenchain) March 2, 2024\n\nReaders will recall I occcasionally mutter about about clip art that represents masks with “Baggy Blues” rather than N95s (making commericial artists and art directors into propagandists for ineffective NPIs). So what does Adobe go and do?\n\nAdobe removed all of the respirator, SARS, COVID, and mask shapes I had been using to make awareness graphics. So now I need a new program\n\nIt has to work on my phone so its accessible and can't be Canva because I am anti genocide. — Gwen B. with LC 𓅟 (@PenGwenWithLC) March 19, 2024\n\nNPIs: UV\n\n“222 nm far-UVC light markedly reduces the level of infectious airborne virus in an occupied room” [Nature]. Mouse study using aerosolized murine norovirus (MNV) as a proxy for SARS-CoV-2. From the Conclusion: “In summary, we have shown for the first time that far-UVC light, operating well within current regulatory limits, is able to produce major reductions in the level of airborne viruses in an occupied indoor location . However, unlike controlled laboratory studies, uncertainties related to airflow pattern, residence time, and actual exposure dose experienced by the collected virus introduces uncertainty into the inactivation estimates. Whole-room disinfection with far-UVC is an emerging intervention for pandemic and epidemic control that has the potential to become part of the layered strategic approach to minimize transmission of airborne pathogens in occupied indoor spaces, including ventilation and filtration and, where appropriate, masks and physical distancing.” • Flagged and discussed by Naomi Wu. And speaking of UV:\n\nLeft behind in the giant movie studio stage from when COVID protocols existed are at least eight $2,565MSRP top of the line industrial air purifiers including UVlight filter in addition to HEPA. Sitting unused, forgotten. — thomas 🛠 (@t_NYC) March 22, 2024\n\nTesting\n\nWithout testing, we’re back to proxies for infection. Like ambulance sirens:\n\n“Will Americans Ever Get a Combination Rapid Test for COVID, Flu, and RSV?” [Very Well Health]. “The COVID-19 pandemic made it commonplace to do an at-home rapid test to diagnose whether winter respiratory symptoms were from the virus. While getting a positive test in just a few minutes can solve the mystery, what if it’s not COVID? Outside of the United States, rapid tests exist for COVID as well as the other primary culprits for cold-weather respiratory symptoms: the flu and RSV. The combination tests are already available in Europe and Australia.” • The United States is not a serious country:\n\nPost by @steeletalks View on Threads\n\nSequelae: Cognition\n\n“Accelerated brain age in young to early middle-aged adults after mild to moderate COVID-19 infection” (preprint) [medRxiv]. From the Abstract: “Cognitive decline is a common adverse effect of the Coronavirus Disease of 2019 (COVID-19), particularly in the post-acute disease phase. The mechanisms of cognitive impairment after COVID-19 (COGVID) remain unclear, but neuroimaging studies provide evidence of brain changes, many that are associated with aging. Therefore, we calculated Brain Age Gap (BAG), which is the difference between brain age and chronological age, in a cohort of 25 mild to moderate COVID-19 survivors (did not experience breathlessness, pneumonia, or respiratory/organ failure) and 24 non-infected controls (mean age = 30 +/− 8) using magnetic resonance imaging (MRI). BAG was significantly higher in the COVID-19 group (F = 4.22, p = 0.046) by 2.65 years. Additionally, 80% of the COVID-19 group demonstrated an accelerated BAG compared to 13% in the control group (X2 = 20.0, p < 0.001). Accelerated BAG was significantly correlated with lower cognitive function (p < 0.041). ”\n\n“Blood Markers Show Neural Consequences of LongCOVID-19” [Cells]. N = 33. From the Conclusion: “This study reports differentially expressed peripheral markers of inflammation and stress after SARS-CoV-2 infection between healthy pre-pandemic controls, people recovered from COVID-19 and neuroLongCOVID-19 subjects. Neurotoxic proteins associated with neurodegeneration were identified from neuronal enriched EVs that differed between the three groups. One or more of the proteins identified in this study have also been shown in other neurological disorders (e.g., AD, HIV-associated neurocognitive disorder, Parkinson’s disease, epilepsy, multiple sclerosis, Guillain–Barre syndrome, amyotrophic lateral sclerosis) with other etiologies (bacteria, fungus, other viruses), suggesting common pathological mechanisms. It remains to be seen, perhaps with the use of machine learning algorithms, whether our specific panel of combined proteins uniquely identifies neuroLongCOVID-19 and, thus, may serve as biomarkers for this disease.”\n\nSequelae: Heart\n\n“The role of COVID-19 vaccines in preventing post-COVID-19 thromboembolic and cardiovascular complications” [Heart]. From the Abtract: “We conducted a staggered cohort study based on national vaccination campaigns using electronic health records from the UK, Spain and Estonia. Vaccine rollout was grouped into four stages with predefined enrolment periods. Each stage included all individuals eligible for vaccination, with no previous SARS-CoV-2 infection or COVID-19 vaccine at the start date…. The study included 10.17 million vaccinated and 10.39 million unvaccinated people….. COVID-19 vaccination reduced the risk of post-COVID-19 cardiac and thromboembolic outcomes. These effects were more pronounced for acute COVID-19 outcomes, consistent with known reductions in disease severity following breakthrough versus unvaccinated SARS-CoV-2 infection.” • I would want the vaccine types and brands separated out; MRNA vs. killed virus, etc.\n\nSequelae: Cancer\n\n“US -Death Trends for Neoplasms ICD codes: C00-D48, Ages 15-44” (preprint) [ResearchGate]. From the Abstract: “In this study we investigate trends in death rates from neoplasms (ICD-10 codes C00-D48) in the USA using crude data from the CDC (Centers for Disease Control and Prevention). We limit our investigation to individuals aged 15 to 44 and for the period of 2010 to 2022…. Using different metrics, we compare mortality trends due to neoplasms before the COVID-19 pandemic with the pandemic period. We show a rise in excess mortality from neoplasms reported as underlying cause of death, which started in 2020 (1.7%) and accelerated substantially in 2021 (5.6%) and 2022 (7.9%). The increase in excess mortality in both 2021 (Z-score of 11.8) and 2022 (Z-score of 16.5) are highly statistically significant (extreme events)…. The results indicate that from 2021 a novel phenomenon leading to increased neoplasm deaths appears to be present in individuals aged 15 to 44 in the US.\n\nSequelae: Long Covid\n\n“Survey Finds Nearly 7% Of American Adults Have Long Covid Symptoms” [Kaiser Health News]. A roundup of coverage on this CDC “Household Pulse” (if any) study.\n\n“Long COVID and Post-COVID Conditions” [Pandemic Patients]. From the introductory paragraphs: “For many people, being exposed to SARS-CoV-2 (the virus that causes COVID-19) results in illness characterized by mild symptoms, resolving in a matter of days or weeks. In fact, research has found that 30-60% of COVID-19 cases may be entirely asymptomatic (Shang et al., 2022; Wang et al., 2023). However, that is not the only potential outcome, and each infection is a new opportunity for long-term symptoms to develop (Bowe et al., 2022). In fact, some people experience severe, debilitating symptoms that may last for several years and may not improve over time (Fernandez-de-las-Peñas et al., 2023). Other people recover from COVID-19, but as a result of the infection, they are now vulnerable to many types of health conditions, known as “post-COVID conditions,” or “PCCs” (Fernandez-de-las-Peñas et al., 2023; Xie et al., 2023). These conditions affect nearly every organ in the body and range from benign to life-threatening (Bowe et al., 2022; D’Isabel et al., 2023; Zhao et al., 2023; Novak et al., 2022; Fernandez-de-las-Peñas et al., 2023; Xie et al., 2023; Peter et al., 2022; Abbasi, 2022; Ormiston et al., 2022; Ma et al., 2023). However, there is no way to know who will be susceptible to a particular condition until it manifests…. [T]he damage done by COVID-19 is cumulative (Bowe et al., 2022). Even someone who recovers from an asymptomatic (Ma et al., 2023) or mild case (Novak et al., 2022) of COVID-19 is at risk of developing one or more PCCs.” • This is an enormous document, and I can’t evaluate everything in it. Perhaps some readers will be motivated to look into it and report back.\n\n“An ER doctor’s experience with long COVID – ‘My symptoms seemed endless'” [Hospital News]. “I didn’t get COVID at work. I got it from my junior kindergarten-aged son after kissing him goodnight in between the stairway banisters…. At the time, I remember feeling lucky to be fully vaccinated, and anticipated a full recovery. I returned to work on day 11 after testing positive for COVID, fatigued, but otherwise fine. I was training for a 10-kilometre run, and on day 16 tried to go for a jog. I couldn’t get down the street. I walked home. ‘That’s odd.’ I thought, believing it was just a premature return to sport. I worked two overnight shifts in the ED that weekend. By day 21, I was suddenly, terrifyingly, sick with something that felt altogether very new. That’s when my life changed forever. After that, long COVID took over my life. My symptoms seemed endless.” But: “Many people ask me what I want the public and physicians to know about long COVID. I think the first is that ‘the tests are not normal’ – we are just not ordering the right tests. Every study of long haulers shows unbelievable pathology: immune dysregulation, mitochondrial dysfunction, neuroinflammation, brain damage, vascular damage, gut dysbiosis, poor perfusion of the brain, lungs and other organs. We just don’t have an easily accessible biomarker yet.” Thanks, NIH! And: “The second thing is that while there are no approved treatments for long COVID yet, there IS hope, and there are treatments that help ! Antihistamines, antidepressants for neuroinflammation, aggressive treatment of autonomic dysfunction, or POTS, resting and pacing for post-exertional malaise – these things can help. The third is that the best way to prevent long COVID is to avoid getting COVID . I use Can95 masks, nasal sprays and HEPA filters… And finally, we need a rapid acceleration of double-blinded, placebo-controlled, randomized clinical trials.”• Again, thanks NIH, which blew a billion dollars on Long Covid without spending on nickel on the search for biomarkers.\n\nSequelae: Versus Flu\n\n“Long-term outcomes following hospital admission for COVID-19 versus seasonal influenza: a cohort study” [The Lancet]. N = 10 ,985. From the Abstract: “Although rates of death and adverse health outcomes following hospital admission for either seasonal influenza or COVID-19 are high, this comparative analysis shows that hospital admission for COVID-19 was associated with higher long-term risks of death and adverse health outcomes in nearly every organ system (except for the pulmonary system) and significant cumulative excess [disability-adjusted life-years (DALYs)] than hospital admission for seasonal influenza.” • So please don’t let anyone tell you “it’s just the flu.” Influenza is bad, and Covid is much worse.\n\n“The Covid-19 pandemic killed off one strain of the flu, and that will change the next vaccines” [CNN]. “Yamagata viruses were in decline before the pandemic, and all the precautions that helped people avoid Covid-19 – including masking, staying at home and better ventilation – appear to have finished them off. They haven’t been detected in testing since March 2020.” • Lockdowns aren’t the only reason people might “stay home,” but they were certainly one reason. So the headline is deceptive: “The pandemic” didn’t kill off anything. NPIs did. A further exchange on this topic:\n\nWhen I pointed out the huge drop in influenza mortality during the pandemic, @DrJBhattacharya, liked this post suggesting \"viral interference\" explained it. There is only one problem with this and that is the total number of RESPIRATORY INFECTIONS OF ALL KINDS DROPPED… pic.twitter.com/Ps5aAWIWHD — Bob Morris, MD, PhD (@rdmorris) March 8, 2024\n\nSequelae: Reproduction\n\n“SARS-CoV-2 infection negatively impacts on the quality of embryos by delaying early embryonic development” (preprint) [medRxiv]. From the Abstract: “Sixty-five SARS-CoV-2 infected infertile patients and 258 controls were involved in this study… SARS-CoV-2 infection reduced the number of oocytes and high-quality embryos on day 3. It delays the early embryonic development from the six-cell stage to blastocyst stage and has a negative impact on the quality of embryos.”\n\n“Updates in the pathophysiology of COVID-19 infection in male reproductive and sexual health: a literature review” [Frontiers in Endrocrinology]. From the Abstract: “We conducted a literature review focusing on the possible pathophysiology by which severe acute respiratory syndrome corona virus 2 (SARS-CoV-2) affects men’s sexual and reproductive systems…. Findings revealed the adverse consequences of SARS-CoV-2 at cellular and organ levels on the male genital tract. However, the reported data are still controversial.”\n\nImmune Dysregulation\n\n“More attention should be paid to Omicron-associated sepsis: a multicenter retrospective study in south China” [Journal of Thoracic Disease]. N = 299. From the Abstract: ” This multicenter retrospective study included adults hospitalized with confirmed SARS-CoV-2 infection across six tertiary hospitals in Guangzhou, China from November 2022 to January 2023. The Sequential Organ Failure Assessment (SOFA) score and its components were calculated at hospital admission to identify sepsis…. In our study, 147 patients (64.19%) were identified as having sepsis upon hospital admission… A considerable proportion of patients infected with Omicron present with sepsis upon hospital admission, which is associated with a poorer prognosis. Therefore, early recognition of viral sepsis by evaluation of the SOFA score in hospitalized coronavirus disease 2019 patients is crucial.” • Yikes. China only?\n\n“Shingles cases are increasing in New South Wales. Experts say COVID might be why” [ABC Australia]. “In 2022, a paper published by Oxford University Press reported that COVID was linked to an increased risk of shingles in patients over 50. Coincidentally, some data suggests shingles cases have increased across age groups in parts of the country since 2020…. But, pointing to the 2022 study of COVID patients being 15 per cent more likely to develop shingles, [Tony Cunningham, director of Westmead Institute’s Centre for Virus Research] said an explanation could be the immune system. One factor for an increased likelihood of shingles is reduced function of the immune system, the same reason why shingles is more common in older people, Professor Cunningham said. Separately, one side effect of COVID can also be reduced function of our immune system. ‘We do know that COVID can disturb immunity, particularly the severe causes where you can get variable responses to COVID,’ Professor Cunningham said. ‘That would be my best bet in the absence of clear evidence.'”\n\n“World’s most deadly infection’ can be transmitted simply by breathing, scientists warn – as cases rise” [The Sun]. “Until now, healthcare experts thought TB germs were transmitted via coughing, laughing or speaking, singing or sneezing. But a new study has found that four in five people testing positive for the killer bug don’t suffer from a cough – previously thought to be a key symptom of TB. However, even those who don’t have a cough carry the infectious disease in their spit, which can be spewed into the air when someone talks or breathes, they found. This means people can pick up the infection just by breathing near someone who has the bug but isn’t showing any obvious signs, they said. ‘A persistent cough is often the entry point for a diagnosis,’ study author Professor Frank Cobelens of Global Health at Amsterdam University Medical Center said. ‘But if 80 per cent of those with TB don’t have [a cough], then it means that a diagnosis will happen later, possibly after the infection has already been transmitted to many others , or not at all,’ he added.” And: “Cases of the Victorian disease increased by over 10 per cent last year, according to the UK Health Security Agency – up from 4,380 in 2022 to 4,850 in 2023.” But: “Health chiefs are scrambling to ‘investigate the reasons’ behind this sudden infection rise.” • ‘Tis a mystery!\n\nChildren\n\n“Lockdowns had an impact on gut microbes and allergies in newborns, new research reveals” [Science Daily]. “The findings highlighted gut health benefits for ‘pandemic babies’ arising from the unique environment of lockdown including lower rates of infection and consequent antibiotic use, and increased duration of breastfeeding. The newborns were found to have more of the beneficial microbes acquired after birth from their mothers. These maternal microbes could be playing a protective role against allergic diseases.” • Lol.\n\nSocial Norming\n\nSome of the people responding seem angry:\n\nFascinating how wearing masks (or not) can be contagious. When boarding my plane, I had on my mask. Several people upon noticing me, also retrieved theirs and put them on. Seems seeing others wearing masks provides a social cue or reassurance to do the same. 😷👍🏽 pic.twitter.com/ywEGgGGfZB — Jerome Adams (@JeromeAdamsMD) March 1, 2024\n\nI don’t know how in the world Trump’s Surgeon General became a beacon of sanity, but here we are (no, Adams isn’t perfect; but at least, unlike Biden’s Vivek Murthy, he’s not wandering around prattling about a loneliness epidemic after Biden managed to infect all our public spaces with an asymptomatic airborne biohazard).\n\n“Always in a 1-on-1 setting”:\n\n\"My field necessitates high risk contact. In conversations with colleagues there are starting to be louder and louder whispers (always 1 on 1, never a group), about Covid having disastrous long term impacts on our health.\" pic.twitter.com/cZYzl111EG — Nate Bear (@NateB_Panic) March 20, 2024\n\nMore reaction to that horrid NPR story:\n\nAnd it's not enough for them to feel like just good people. They need to feel like most moral, most reasonable people in the room at all times. — lizwhatsherface (@RealGayArbys) March 11, 2024\n\nNot sure what the equivalent armchair psychology for conservatives would be (maybe if they understand that NPIs. as one layer in a multilayer strategy, would replace our current vax-only strategy?)\n\nMore armchair psychology (not that there’s anything wrong with that):\n\n#1 – Denial – Pretending a problem does not exist to provide artificial relief from anxiety. Examples: “During COVID” or “During the pandemic” (past tense) “The pandemic is over” “Covid is mild” “It’s gotten milder” “Covid is now like a cold or the flu” “Masks don’t work… pic.twitter.com/W2LbrMyrZC — Mike Hoerger, PhD MSCR MBA (@michael_hoerger) December 20, 2023\n\nHere is the ThreadReader.app version.\n\nGaslighting\n\nSo many, many examples of The Semmelweis Reflex:\n\nNext time you're feeling #gaslit, remember Alton Ochsner was subject to \"ridicule and #vituperative attacks\" for his advocacy linking smoking to the \"rare\" condition of lung cancer. pic.twitter.com/T5O0J2WGDW — Mike Hoerger, PhD MSCR MBA (@michael_hoerger) March 23, 2024\n\n“Experts Can’t Agree If We’re Still in a Pandemic” [Time]. “But are we still a pandemic? No one seems to know for sure. When I asked Dr. Mandy Cohen, director of the U.S. Centers for Disease Control and Prevention (CDC), she didn’t give a direct answer. ‘Rather than getting caught up in the semantics of it,’ she says, people should feel confident that ‘we are outside of the emergency [phase]. But I don’t want folks to forget that COVID is still here and still poses a risk.'” Which is why Mandy still masks. Oh, wait…. More: “Dr. Robert Wachter, chair of medicine at the University of California, San Francisco, has stopped using the word ‘pandemic,’ which he says was a ‘shorthand way to convey to the public’ that COVID-19 constituted a worldwide emergency that required a global shift in behavior. But calling it a pandemic now ‘ just doesn’t feel right ,’ he says. In his opinion, we’ve been out of the pandemic phase for about a year, given the widespread availability of tests, treatments, and vaccines.” And mass infection. Maybe Wachter has a 23-step procedure for determining vibes? “So what’s the word to use now? Experts interviewed for this story were hesitant to pick one. ‘We really don’t have the language for things that are somewhere between flus and cold viruses and pandemics,’ [Dr. Jonathan Quick, an adjunct professor at the Duke Global Health Institute] says.'” • Idea: How about “pandemic”?\n\nOfficial Maleficence\n\n“Covid no longer controls our lives.” —Joe Biden. Commentary:\n\nOne thing I wish more people knew about the US economic recovery from the *pandemic-induced* recession is that far more working age adults died of covid from Mar2021-Feb2022 (146,896) than Mar2020-Feb2021 (104,042) — despite improved knowledge, vaccines, and Biden as president pic.twitter.com/2plsQsL9I3 — wsbgnl (@wsbgnl) March 7, 2024\n\nShould somebody check in on the Infectious Diseases Society of America?\n\nYep, confirmed. That utter wanker @CarlosdelRio7 is the new president of @IDSAInfo. Carlos is the shit bird from Delta that got the original 10 days lowered to 5 days, which resulted in the greatest amount of LongCovid by any one person in history. Fuck you, Carlos. https://t.co/DjyNaAwPyP pic.twitter.com/qA1wBQffmP — Lazarus Long (@LazarusLong13) March 3, 2024\n\nDel Rio:\n\nBottom signature on the left… Carlos del Rio. pic.twitter.com/ktJi7CW4VJ — Taylor Whitney (@taylorwhitney88) March 3, 2024\n\nKa-ching!\n\n“Critical Care Nurses’ Moral Resilience, Moral Injury, Institutional Betrayal, and Traumatic Stress After COVID-19” [American Journal of Critical Care]. N = 121, online survey. From the Abstract: “Traumatic stress and moral injury may contribute to burnout, but their relationship to institutional betrayal and moral resilience is poorly understood, leaving risk and protective factors understudied…. Of participating nurses, 71.5% reported significant moral injury symptoms and/or traumatic stress. Both moral injury symptoms and traumatic stress were associated with burnout. Regression models showed that institutional betrayal was associated with increased likelihood of traumatic stress and moral injury…. [S]ystem factors (eg, institutional betrayal) must also be addressed systemically rather than relying on individual-level interventions to address nurses’ needs.”\n\n* * *\n\nAnd speaking of institutional betrayal:\n\nHow Mandy Cohen would have gotten people to follow CDC Guidance on indoor smoking in the 90's: pic.twitter.com/22COif6ogJ — Love thy neighbor: wear an N95😷 (@CCSDMaskUp) March 2, 2024\n\nIt’s been a long, long time since I agreed with Imani Gandy about anything:\n\nThe CDC now recommends that you quote go fuck yourself end quote https://t.co/wxcZwCZ7qo — Imani Gandy (Orca’s Version) ⚓️ (@AngryBlackLady) March 2, 2024\n\n* * *\n\nAnd the WHO:\n\nLook at this. The @WHO corrects an earlier incorrect tweet via an ERRATUM tweet. So they CAN if they want to. But somehow they REFUSE to write an erratum for the many “COVID-19 is NOT airborne” tweets that are still uncorrected and can still misinform the world.@gabbystern? https://t.co/ZN5IQf1Ip7 — Maarten De Cock (@mdc_martinus) March 1, 2024\n\nYes, this infamous (and false) post is still up, still doing damage;\n\nFACT: #COVID19 is NOT airborne. The #coronavirus is mainly transmitted through droplets generated when an infected person coughs, sneezes or speaks. To protect yourself:\n\n-keep 1m distance from others\n\n-disinfect surfaces frequently\n\n-wash/rub your 👐\n\n-avoid touching your 👀👃👄 pic.twitter.com/fpkcpHAJx7 — World Health Organization (WHO) (@WHO) March 28, 2020\n\nAnd no Erratum. Funny thing.\n\nEugenics\n\n“The Great Barrington Declaration Wasn’t a Plan For Public Health Officials. It Was a List of Absurd Demands of Them” [Science-Based Medicine]. “[L]et’s consider the plan to to ‘protect the vulnerable’, which was the pillar of the Great Barrington Declaration (GBD). How might we have accomplished this laudable goal? Though many people thought the best way to protect the vulnerable was to limit spread of COVID and vaccinate as many people as possible, the GBD claimed that by spreading the virus among hundreds of millions of unvaccinated, ‘not vulnerable’ Americans, herd immunity would arrive in 3-6 months, and the pandemic would be ‘naturally over.'” Obviously, that was a debacle, and therefor its proponents are still making bank, along with the neocons who got us unto the Iraq War, Larry Summers, and everyone else who’s wrong about everything. More: “A section of the GBD titled Protecting the Old and Other High-Risk Groups laid out their ‘plan’, which they called ‘focused protection.’ You should take 5 minutes and read it. It’s just 880-words long. Their answer to the question ‘How do we protect older people living at home?’ was only four sentences long… To pick just one example, the GBD wrote that ‘During high transmission times, older people should be offered home delivery of groceries and other essentials.’ That sounds nice, but it’s worth thinking seriously about this part of their ‘plan’ for a moment, something the authors of the GBD clearly did not do. Creating a program overnight to deliver fresh food and other essentials to tens of millions of seniors for months on end while the virus spread uncontrolled would not be an easy task…. In an interview from October 2021, a year after the publication of the GBD, Dr. Jay Bhattacharya sought to answer these questions by saying: “We could have offered free DoorDash to older people. I mean, yeah, it would depend on the community and the living circumstances. It would be a local thing, right?” This was obviously something Dr. Bhattacharya just thought of off the top of his head. The idea of millions of homebound seniors surviving off DoorDash for months on end is something a high school student might come up with.” • A high school master debater…\n\n“”Poor, poor pitiful me”: Was Martin Kulldorff fired by Harvard?” [Respectful Insolence]. “If there is one narrative that is a constant among purveyors of misinformation, pseudoscience, quackery, and conspiracy theories, it’s a persecution narrative. In the realm of medicine and health, for instance, brave maverick doctors (like, for example, Martin Kulldorff) promoting antivaccine views and quackery, as well as the conspiracy theories that undergird them, always portray themselves as the hero persecuted by the medical and scientific establishment. While it is true that there have been physicians with alternative medical theories who were unfairly ostracized and persecuted but turned out to be right (e.g., Ignaz Semmelweis), in the vast majority of cases, the immortal words of Carl Sagan apply: ‘But the fact that some geniuses were laughed at does not imply that all who are laughed at are geniuses. They laughed at Columbus, they laughed at Fulton, they laughed at the Wright brothers. But they also laughed at Bozo the Clown.’… One of the GBD’s own flacks even (sort of) admitted it. It was always nothing more than an attempt to place a scientific veneer on a libertarian ‘open it all up’ strategy that would ignore the harms of the pandemic in favor of economics. It arguably did help achieve the cherished aim of anti-government activists and antivaxxers by, in essence, seriously degrading governments’ ability to institute public health measures during a pandemic. Through it all, going on for months and months, Kulldorff kept promising that ‘natural herd immunity’ was just 3-6 months away.” • And he’s still making bank, along with Bhattacharya and the other service providers at the house of ill fame that is Standord.\n\n* * *\n\nBallastexistenzen (1):\n\nSome people living with disabilities are worried about the stress of facing unexpected questions about whether they have considered #MAID. Some are drawing up cards, like the one below. Others suggest ID bracelets that say \"No MAID\".\n\n\"So many of us are worried about this,\"… pic.twitter.com/stYL01SFbG — Avis Favaro (@Avis_Favaro) March 19, 2024\n\nBallastexistenzen (2):\n\nNothing quite sums up the hegemonic project of covid normalisation, and the total disregard for the lives of the vulnerable necessary to that project, like the last polio survivor living in an iron lung being killed by covid https://t.co/TxwWMvQEu4 — Nate Bear (@NateB_Panic) March 13, 2024\n\n* * *\n\nConclusion\n\nUnfortunately, I couldn’t splice everything together; there are only so many hours in the day. (Do note that the incredible volume of discourse on this topic is a hopeful sign; and some serious work is even breaking through to the national media, at long last.) Recently, many of you were highly complimentary of Naked Capitalism’s Covid coverage. However, I have been conscious of my own inability to get to every story and article that deserved to be covered. I hope this post makes up for that, in some measure. Let’s go save some lives!",
      "article_summary": "“The COVID-19 pandemic made it commonplace to do an at-home rapid test to diagnose whether winter respiratory symptoms were from the virus.\nUsing different metrics, we compare mortality trends due to neoplasms before the COVID-19 pandemic with the pandemic period.\nIn fact, research has found that 30-60% of COVID-19 cases may be entirely asymptomatic (Shang et al., 2022; Wang et al., 2023).\nThese conditions affect nearly every organ in the body and range from benign to life-threatening (Bowe et al., 2022; D’Isabel et al., 2023; Zhao et al., 2023; Novak et al., 2022; Fernandez-de-las-Peñas et al., 2023; Xie et al., 2023; Peter et al., 2022; Abbasi, 2022; Ormiston et al., 2022; Ma et al., 2023).\n“The Covid-19 pandemic killed off one strain of the flu, and that will change the next vaccines” [CNN].",
      "article_keywords": [
         "immune",
         "norming",
         "roundup",
         "npis",
         "covid19",
         "et",
         "pandemic",
         "infection",
         "sequelae",
         "dysregulation",
         "al",
         "official",
         "social",
         "eugenics",
         "health",
         "air",
         "study",
         "maleficence",
         "covid",
         "sarscov2"
      ]
   },
   {
      "article_url": "https://www.nbcnews.com/news/world/princess-kates-cancer-treatment-news-sparks-remorse-people-spread-cons-rcna144684",
      "article_title": "WWDC 2024 Date: Exactly When Apple Will Reveal iPhone, Mac And iPad Software",
      "article_title_generate": "Princess Kate’s cancer treatment news sparks remorse from people who spread conspiracies and memes online",
      "article_publisher": "NBC News",
      "article_text": "For weeks, hundreds of people online have spread conspiracy theories, posted memes and cracked jokes in an attempt to answer one question: Where is Kate Middleton, the Princess of Wales?\n\nKensington Palace repeatedly said that Kate was recovering from a planned January abdominal surgery. Still, official responses, as well as an edited image posted to the palace’s social media channels, only fueled more unsubstantiated rumors.\n\nBut many people who had partaken in the online frenzy found themselves expressing regret after the princess broke her silence on Friday. In a video message to the public, the 42-year-old wife of Prince William, Britain’s future king, announced she was diagnosed with cancer and is undergoing chemotherapy.\n\nActress Blake Lively was among the first to make a statement online apologizing for her now-deleted Instagram post, a Photoshop joke inspired by the manipulated Mother’s Day photo released by Kensington Palace.\n\n“I’m sure no one cares today but I feel like I have to acknowledge this,” Lively wrote in an Instagram story. “I made a silly post around the ‘photoshop fails’ frenzy, and oh man, that post has me mortified today. I’m sorry.”\n\nThat sentiment dominated much of the reaction on social media, where users said they wished they hadn’t poked fun at the princess.\n\n“Yeah i definitely feel bad about laughing at all the ‘KateGate’ memes. wishing her a speedy recovery,” wrote Saint Hoax, an influencer who has amassed a following of 3.4 million on Instagram, where they post memes related to current events.\n\nThe fervor around Kate’s whereabouts — and subsequent online remorse — has underscored a pattern in which the absence of information provides perfect fodder for creators chasing relevance on algorithm-driven social media platforms.\n\n“Everybody’s trying to jump in to get a piece of the viral pie, so to speak,” said Jessica Maddox, an assistant professor of digital media technology at the University of Alabama. “When we look at the intersection of conspiracy theories and social media, particularly content creators, everybody wants to have the hottest take, especially when information isn't known.”\n\nBut Maddox said she hasn’t seen such remorse before in any online conspiracy culture. Usually when internet sleuths are proven wrong, she said, they double down by shifting the goalposts to further deny new evidence and justify their actions.\n\nMany online said Kate’s news also serves as a reminder to stop making assumptions about people’s personal lives.\n\nIt’s a sentiment that’s popped up online before, particularly when celebrities and public figures are overly scrutinized or become the subject of unsupported claims by their followers.\n\nSome fans of actor Chadwick Boseman expressed similar regret about commenting on his weight loss when it was revealed after his death that he had been quietly battling colon cancer for years. In April 2023, pop star Ariana Grande spoke out about the public’s “concerns” about her body, saying “you never know what someone is going through.”\n\nThe Kate news has also highlighted the tension between the public’s desire to know every detail about the royal family and the royals’ desire to keep their health struggles private. The princess’ father-in-law, King Charles III, was diagnosed with cancer earlier this year. Charles has canceled public engagements while he receives treatment.\n\nReshma Saujani, CEO of nonprofit Girls Who Code, which empowers and equips young girls to pursue careers in STEM, said she felt “disgusted with the internet” when she heard about Kate’s news.\n\n“Disgusted with the internet and even disgusted with myself because I fell into the trap,” Saujani wrote in an Instagram post. “This is a classic example of what we do to women, of how when a woman takes time to prioritize her health and take care of her family, we second guess it to the point of coming up with conspiracy theories to explain her self care.”\n\nWith Kate’s news now public, Jessica Myrick, a Pennsylvania State University professor who studies the psychology of media use, suggested that the online chatter surrounding Kate may wind down.\n\nBut, Myrick doesn’t think that social media users will stop creating conspiracy theories online in general, despite expressing some remorse over the Kate news.\n\n“There are not a lot of consequences for sharing memes on social media, and if anything, the likes that people got, the laughs, the comments ... that’s probably reinforcing and will probably mean we’ll do it all again,” Myrick said.\n\nIn her message on Friday, Kate asked people to respect the family’s privacy.\n\n“We hope that you will understand that, as a family, we now need some time, space and privacy while I complete my treatment,” she said. “My work has always brought me a deep sense of joy and I look forward to being back when I am able, but for now I must focus on making a full recovery.”",
      "article_summary": "For weeks, hundreds of people online have spread conspiracy theories, posted memes and cracked jokes in an attempt to answer one question: Where is Kate Middleton, the Princess of Wales?\nStill, official responses, as well as an edited image posted to the palace’s social media channels, only fueled more unsubstantiated rumors.\nI’m sorry.”That sentiment dominated much of the reaction on social media, where users said they wished they hadn’t poked fun at the princess.\nwishing her a speedy recovery,” wrote Saint Hoax, an influencer who has amassed a following of 3.4 million on Instagram, where they post memes related to current events.\nBut, Myrick doesn’t think that social media users will stop creating conspiracy theories online in general, despite expressing some remorse over the Kate news.",
      "article_keywords": [
         "kate",
         "media",
         "memes",
         "conspiracy",
         "post",
         "theories",
         "social",
         "cancer",
         "princess",
         "treatment",
         "remorse",
         "kates",
         "conspiracies",
         "sparks",
         "public",
         "spread",
         "online"
      ]
   },
   {
      "article_url": "https://english.aawsat.com/business/4930046-pakistan%E2%80%99s-president-awards-medal-saudi-fund-development-ceo",
      "article_title": "Iran’s Currency Hits Record Low",
      "article_title_generate": "Pakistan’s President Awards Medal to Saudi Fund for Development CEO",
      "article_publisher": "Asharq Al-Awsat",
      "article_text": "Foreign Investment in China Drops by 20%\n\nChina will make greater efforts to diffuse debt risks of financing platforms, said Chinese premier Li Qiang in a meeting focusing on mitigating risks of local government debt on Friday.\n\nChina will resolutely block the path for irregular and disguised debts and strictly prevent the risk of newly-added debts, said Li.\n\nThe Commerce ministry said on Friday that foreign investment into China fell 19.9% in the first two months of 2024 from the amount in January-February last year to 215 billion yuan ($30 billion).\n\nChina on Tuesday unveiled new steps to arrest a slowdown in foreign investment, including expanding market access and relaxing some rules.\n\nOverseas firms have turned sour on China since it enacted ultra-strict COVID curbs during the pandemic then suddenly abandoned them in late 2022, with concerns over the business environment, a shaky economic recovery and rising geopolitical tensions with the West weighing on confidence.\n\nA series of prolonged regulatory crackdowns on sectors from technology to education have also rattled domestic and foreign investors, adding to unease over policy transparency in China.\n\nUS Commerce Secretary Gina Raimondo said last year that American businesses had told her that China was becoming “uninvestible.”\n\nIn 2023, foreign direct investment into China shank 8% year-on-year.\n\nOf the foreign investment in the first two months, 71.44 billion yuan, or a third of the total, went into China's high-tech industries, including high-tech manufacturing, the ministry said.\n\nForeign investment in China's construction sector rose 43.6% year-on-year, while investment in wholesale and retail industries grew 14.5%, it added.\n\nIn return, China’s central government accelerated spending at the start of the year, a sign it’s taking on more financing responsibility to support the economy and to avoid worsening local government debt risks, Bloomberg reported.\n\nIts general public expenditure jumped 14% from a year earlier to 482.8 billion yuan ($66.8 billion) in January and February combined, the fastest pace for the period in five years, according to data provided by the Ministry of Finance.\n\nBloomberg said Beijing is gradually shifting the responsibility for supporting economic growth to central government from local officials — a way to maintain the level of investment while defusing local debt risks.\n\nLocal governments have been struggling after a property crisis reduced a critical source of income from land sales, and a slowing economy weighed on tax revenues.\n\nThe latest data shows Beijing intends to “underpin growth while preventing risks,” said Xing Zhaopeng, senior China strategist at Australia & New Zealand Banking Group Ltd.\n\nCentral and local authorities spent almost 700 billion yuan in the first two months on agriculture, forest and irrigation-related issues, as well as urban and rural community development. This is up 22% from a year earlier.\n\nIn a separate development, China's securities regulator launched onsite inspections of some mutual fund companies as part of efforts to strengthen management of the industry, unnerving fund managers.\n\nThe securities watchdog, under newly appointed Chairman Wu Qing, vowed a week ago to set up a “textbook-style” supervision model to regulate China's $3.8 trillion mutual fund industry, according to Reuters.\n\nThe latest round of inspections, conducted without notice by branches of the China Securities Regulatory Commission (CSRC), covered daily operations, training, and strengthening internal Chinese Communist Party functions, the 21st Century Business Herald reported on Friday. It did not name the asset managers inspected.\n\nIn response to a Reuters query, CSRC said: “It's regular on-site inspection that we conduct every year.”\n\nThe CSRC branches inspected fund companies based outside their regions, which the article said can prevent local interference. Regulators have recently cracked down on computer-driven “quant” private funds.",
      "article_summary": "The Commerce ministry said on Friday that foreign investment into China fell 19.9% in the first two months of 2024 from the amount in January-February last year to 215 billion yuan ($30 billion).\nChina on Tuesday unveiled new steps to arrest a slowdown in foreign investment, including expanding market access and relaxing some rules.\nForeign investment in China's construction sector rose 43.6% year-on-year, while investment in wholesale and retail industries grew 14.5%, it added.\nBloomberg said Beijing is gradually shifting the responsibility for supporting economic growth to central government from local officials — a way to maintain the level of investment while defusing local debt risks.\nIn a separate development, China's securities regulator launched onsite inspections of some mutual fund companies as part of efforts to strengthen management of the industry, unnerving fund managers.",
      "article_keywords": [
         "risks",
         "awards",
         "yuan",
         "ceo",
         "foreign",
         "saudi",
         "medal",
         "president",
         "investment",
         "pakistans",
         "chinas",
         "debt",
         "china",
         "billion",
         "local",
         "fund",
         "development"
      ]
   },
   {
      "article_url": "https://english.aawsat.com/business/4929356-iran%E2%80%99s-currency-hits-record-low",
      "article_title": "The Legend of Dragon Ball...a New Investment Journey in Saudi Arabia",
      "article_title_generate": "Iran’s Currency Hits Record Low",
      "article_publisher": "Asharq Al-Awsat",
      "article_text": "Foreign Investment in China Drops by 20%\n\nChina will make greater efforts to diffuse debt risks of financing platforms, said Chinese premier Li Qiang in a meeting focusing on mitigating risks of local government debt on Friday.\n\nChina will resolutely block the path for irregular and disguised debts and strictly prevent the risk of newly-added debts, said Li.\n\nThe Commerce ministry said on Friday that foreign investment into China fell 19.9% in the first two months of 2024 from the amount in January-February last year to 215 billion yuan ($30 billion).\n\nChina on Tuesday unveiled new steps to arrest a slowdown in foreign investment, including expanding market access and relaxing some rules.\n\nOverseas firms have turned sour on China since it enacted ultra-strict COVID curbs during the pandemic then suddenly abandoned them in late 2022, with concerns over the business environment, a shaky economic recovery and rising geopolitical tensions with the West weighing on confidence.\n\nA series of prolonged regulatory crackdowns on sectors from technology to education have also rattled domestic and foreign investors, adding to unease over policy transparency in China.\n\nUS Commerce Secretary Gina Raimondo said last year that American businesses had told her that China was becoming “uninvestible.”\n\nIn 2023, foreign direct investment into China shank 8% year-on-year.\n\nOf the foreign investment in the first two months, 71.44 billion yuan, or a third of the total, went into China's high-tech industries, including high-tech manufacturing, the ministry said.\n\nForeign investment in China's construction sector rose 43.6% year-on-year, while investment in wholesale and retail industries grew 14.5%, it added.\n\nIn return, China’s central government accelerated spending at the start of the year, a sign it’s taking on more financing responsibility to support the economy and to avoid worsening local government debt risks, Bloomberg reported.\n\nIts general public expenditure jumped 14% from a year earlier to 482.8 billion yuan ($66.8 billion) in January and February combined, the fastest pace for the period in five years, according to data provided by the Ministry of Finance.\n\nBloomberg said Beijing is gradually shifting the responsibility for supporting economic growth to central government from local officials — a way to maintain the level of investment while defusing local debt risks.\n\nLocal governments have been struggling after a property crisis reduced a critical source of income from land sales, and a slowing economy weighed on tax revenues.\n\nThe latest data shows Beijing intends to “underpin growth while preventing risks,” said Xing Zhaopeng, senior China strategist at Australia & New Zealand Banking Group Ltd.\n\nCentral and local authorities spent almost 700 billion yuan in the first two months on agriculture, forest and irrigation-related issues, as well as urban and rural community development. This is up 22% from a year earlier.\n\nIn a separate development, China's securities regulator launched onsite inspections of some mutual fund companies as part of efforts to strengthen management of the industry, unnerving fund managers.\n\nThe securities watchdog, under newly appointed Chairman Wu Qing, vowed a week ago to set up a “textbook-style” supervision model to regulate China's $3.8 trillion mutual fund industry, according to Reuters.\n\nThe latest round of inspections, conducted without notice by branches of the China Securities Regulatory Commission (CSRC), covered daily operations, training, and strengthening internal Chinese Communist Party functions, the 21st Century Business Herald reported on Friday. It did not name the asset managers inspected.\n\nIn response to a Reuters query, CSRC said: “It's regular on-site inspection that we conduct every year.”\n\nThe CSRC branches inspected fund companies based outside their regions, which the article said can prevent local interference. Regulators have recently cracked down on computer-driven “quant” private funds.",
      "article_summary": "The Commerce ministry said on Friday that foreign investment into China fell 19.9% in the first two months of 2024 from the amount in January-February last year to 215 billion yuan ($30 billion).\nChina on Tuesday unveiled new steps to arrest a slowdown in foreign investment, including expanding market access and relaxing some rules.\nOf the foreign investment in the first two months, 71.44 billion yuan, or a third of the total, went into China's high-tech industries, including high-tech manufacturing, the ministry said.\nForeign investment in China's construction sector rose 43.6% year-on-year, while investment in wholesale and retail industries grew 14.5%, it added.\nBloomberg said Beijing is gradually shifting the responsibility for supporting economic growth to central government from local officials — a way to maintain the level of investment while defusing local debt risks.",
      "article_keywords": [
         "risks",
         "hits",
         "yuan",
         "record",
         "foreign",
         "investment",
         "currency",
         "chinas",
         "debt",
         "china",
         "billion",
         "local",
         "fund",
         "low",
         "irans"
      ]
   },
   {
      "article_url": "https://english.aawsat.com/business/4929071-legend-dragon-balla-new-investment-journey-saudi-arabia",
      "article_title": "Ryanair in Kosice: 500,000 Passengers & New Flights",
      "article_title_generate": "The Legend of Dragon Ball...a New Investment Journey in Saudi Arabia",
      "article_publisher": "Asharq Al-Awsat",
      "article_text": "The world’s first theme park dedicated to the Dragon Ball universe of comics, movies, and games will be built in Saudi Arabia, the Qiddiya Investment Company announced.\n\nThe park is located only 40 minutes from Riyadh and will span 500,000 square meters, featuring seven themed lands based on different Dragon Balls, more than 30 themed rides across the lands, in addition to five major attractions, hotels and restaurants.\n\nExperts said that the new project opens the way for other successive investments in the world of comics, explaining that such activities attract giant international companies specialized in entertainment to invest in Saudi Arabia.\n\nThe General Manager and CEO of Abdul Mohsen Al Hokair Company, Majed Al Hokair, told Asharq Al-Awsat that the establishment of an amusement park inspired by the Japanese animation series targets many segments of society and fans of comics.\n\nHe added that the project will contribute to achieving the new strategy of Crown Prince Mohammed bin Salman bin Abdulaziz to attract more than 150 million visitors annually during 2030.\n\n“Diversification in projects provides an integrated destination with multiple choices, extending the days spent by visitors to Saudi Arabia over long periods, in addition to creating job and other opportunities,” Al Hokair remarked.\n\nFor his part, the founder and CEO of Amla Tourism Investment Company, Nasser Al-Ghaylan, told Asharq Al-Awsat that Dragon Ball was one of the new qualitative projects that encourage local and international companies to invest in Saudi Arabia.\n\nHe added that the project will have a positive impact on the private sector’s contribution to the Kingdom’s GDP.\n\nThis announcement comes at a time when Qiddiya entered into a long-term strategic partnership with Toei Animation, the Japanese animation company and creator of the original Dragon Ball characters.\n\nThe Managing Director of the Qiddiya Investment Company, Abdullah bin Nasser Al-Daoud, stated that the partnership will help create an exceptional entertainment park that provides a unique combination of adventures and fun, as well as a diverse entertainment experience suitable for all tastes.",
      "article_summary": "The world’s first theme park dedicated to the Dragon Ball universe of comics, movies, and games will be built in Saudi Arabia, the Qiddiya Investment Company announced.\nExperts said that the new project opens the way for other successive investments in the world of comics, explaining that such activities attract giant international companies specialized in entertainment to invest in Saudi Arabia.\nFor his part, the founder and CEO of Amla Tourism Investment Company, Nasser Al-Ghaylan, told Asharq Al-Awsat that Dragon Ball was one of the new qualitative projects that encourage local and international companies to invest in Saudi Arabia.\nHe added that the project will have a positive impact on the private sector’s contribution to the Kingdom’s GDP.\nThe Managing Director of the Qiddiya Investment Company, Abdullah bin Nasser Al-Daoud, stated that the partnership will help create an exceptional entertainment park that provides a unique combination of adventures and fun, as well as a diverse entertainment experience suitable for all tastes.",
      "article_keywords": [
         "hokair",
         "bin",
         "legend",
         "saudi",
         "investment",
         "balla",
         "arabia",
         "park",
         "dragon",
         "qiddiya",
         "project",
         "entertainment",
         "company",
         "journey"
      ]
   },
   {
      "article_url": "https://aviationsourcenews.com/airline/ryanair-0-5m-passengers-in-kosice/",
      "article_title": "Upgraded Cabin: 5 Unique Features Of A HondaJet Cockpit",
      "article_title_generate": "Ryanair in Kosice: 500,000 Passengers & New Flights",
      "article_publisher": "AviationSource",
      "article_text": "On March 18, 2024, Ryanair (FR/RYR) has celebrated 500,000 passengers in Kosice and launches new summer schedule.\n\nThis article will cover the details surrounding Ryanair’s milestone at Kosice and the details of its new summer schedule.\n\nRyanair’s Kosice Milestone\n\nPhoto Credit: Gameplayzz, CC BY-SA 4.0 https://creativecommons.org/licenses/by-sa/4.0, via Wikimedia Commons\n\nThis week on March 18, Ryanair has celebrated carrying 500,000 passengers in and out of Kosice Airport (KSC) in Slovakia.\n\nAlongside celebrating this major milestone for their Slovakian operations, Ryanair has also launched their new summer schedule at the airport.\n\nThe new schedule comes with the addition of one new route, alongside the previous four destinations that were operated last season.\n\nThe new route is to Zadar Airport (ZAD) in Croatia.\n\nZadar joins the Kosice summer schedule alongside the following –\n\nDublin in Ireland.\n\nLiverpool in the United Kingdom.\n\nPrague in the Czech Republic.\n\nLondon Stansted in the United Kingdom.\n\nThis new summer schedule is expected to bring Ryanair’s Kosice passenger count to 100,000 per year. This will also support over 100 jobs at the airport.\n\nThe European ULCC (Ultra Low Cost Carrier), doesn’t just serve Kosice in Slovakia. The carrier also have a heavy footing in the country’s capital, Bratislava.\n\nCommenting on their milestone and new summer schedule, Ryanair’s Country Manager of CEE & Baltics, Alicja Golebiowska, says, “As Europe’s biggest airline, Ryanair is delighted to celebrate milestone of 0.5 million passengers carried through Kosice with the launch of our Summer ’24 schedule, providing 5 routes to the likes of Dublin, London, and our latest addition to Kosice schedule – sunny Zadar.”\n\n“To allow our customers and visitors to/from Kosice to book their Summer getaway at the lowest fares, we are launching a special promo with seats available from just €21.99 for travel between Apr and May ’24 at www.ryanair.com.”\n\nAdditionally, Kosice Airport’s Chief Executive Officer, Deputy and Member of the Management Board, Tomáš Jančuš, adds, “We are thrilled to witness Ryanair’s escalating confidence in our market. This summer, Ryanair presents its most extensive schedule ever from Košice, featuring five routes.”\n\n“These connections promise substantial benefits for the entire Eastern Slovakia, fostering growth in both tourism and business opportunities. We are particularly excited about the new route to Zadar, which significantly reduces the travel time to the Adriatic coast from over 10 hours to just 90 minutes.”\n\nRyanair’s Latest News…\n\nIn addition, the below is the latest news regarding Ryanair –\n\nAt the Aviation Summit 2024, Ryanair CEO Michael O’Leary disclosed that their engineers have found spanners belonging to Boeing in their new 737 MAXs. Read our article here.\n\nThe NATS CEO Martin Rolfe will be attending Airspace World 2024 as a speaker on Crisis Management. Ryanair has dubbed this as “Comedy gold”. Read our article here.\n\nRyanair has the week announced that it has added over 4,000 extra seats between the UK and Germany ahead of the highly anticipated UEFA European Football Championship taking place this summer. Read our article here.\n\nRyanair has weighed in the recent interim report published by the Civil Aviation Authority (CAA) regarding the collapse of the UK National Air Traffic Services (NATS) on 28th August. Read our article here.\n\nIrish low-cost carrier Ryanair has celebrated the handling of 45m passengers in Bologna, Italy by adding more flights for the Summer. Read our article here.\n\nDid you know AviationSource has two newsletters? One covers the general news and analysis of the industry as a whole, and the other to do with emergencies that take place throughout the year! To subscribe to our General News Newsletter, CLICK HERE!\n\nTo subscribe to our Emergencies, Accidents & Incidents Newsletter, CLICK HERE!\n\nClick the photo to join our WhatsApp channel so then you can stay up to date with everything going on in the aviation industry!",
      "article_summary": "On March 18, 2024, Ryanair (FR/RYR) has celebrated 500,000 passengers in Kosice and launches new summer schedule.\nThis article will cover the details surrounding Ryanair’s milestone at Kosice and the details of its new summer schedule.\nRyanair’s Kosice MilestonePhoto Credit: Gameplayzz, CC BY-SA 4.0 https://creativecommons.org/licenses/by-sa/4.0, via Wikimedia CommonsThis week on March 18, Ryanair has celebrated carrying 500,000 passengers in and out of Kosice Airport (KSC) in Slovakia.\nZadar joins the Kosice summer schedule alongside the following –Dublin in Ireland.\nThis new summer schedule is expected to bring Ryanair’s Kosice passenger count to 100,000 per year.",
      "article_keywords": [
         "ryanair",
         "summer",
         "milestone",
         "route",
         "schedule",
         "kosice",
         "500000",
         "flights",
         "read",
         "ryanairs",
         "article",
         "passengers"
      ]
   },
   {
      "article_url": "https://uk.finance.yahoo.com/news/week-ahead-kingfisher-pennon-fevertree-180215015.html",
      "article_title": "Altcoin Trader Reveals Strategy For the Meme Coin Mania",
      "article_title_generate": "Week ahead: Kingfisher, Pennon, Fevertree and Ocado",
      "article_publisher": "Yahoo! UK & Ireland",
      "article_text": "In a quiet week for economic announcements, London markets are expecting updates from Kingfisher, Pennon Group, Fevertree, Ocado and Carnival.\n\nIn a quiet week for economic announcements, London markets are expecting updates from Kingfisher, Fevertree, Ocado and Carnival.\n\nKingfisher\n\nKingfisher, which owns B&Q, has been battered by cost-of-living headwinds and a turbulent housing market. The firm cut its full-year pre-tax profit forecast to £560m in November as it forecast tough conditions through the winter.\n\nInvestors will be looking for an increase in the retailer’s e-commerce activity, which has been seen as a “potential saviour” for sales going forward, according to Hargreaves Lansdown’s Susannah Streeter.\n\nShe added: “With interest rates eyed on the horizon, UK house prices stabilising, and buyers and sellers gaining confidence, there’s hope that demand for home makeovers and renovations will rise.”\n\nADVERTISEMENT\n\n“But, although around three-quarters of earnings are driven by the UK, Kingfisher also needs to see improvements in other markets, like France, where the economic climate hasn’t been clement, and rivals like Leroy Merlin are proving tougher competitors.’’\n\nPennon Group\n\nPennon Group’s recent £89m acquisition of Sutton and East Surrey Water will be top of the agenda as it delivers a trading update on Monday.\n\nThe deal is still subject to approval by the UK Competition and Markets Authority (CMA), so investors are looking for any insight into how it’s moving forward, alongside an indication of performance ahead of the full-year results in May.\n\n“The £89m price tag looks attractive and helps Pennon increase its foothold across Southern England by bringing more than 750,000 paying customers into the fold,” Aarin Chiekrie, equity analyst at Hargreaves Lansdown, said.\n\nHe added: “The deal’s been financed by cash on hand, but because of SES Water’s high levels of debt, Pennon went out and raised £180m of cash by issuing new equity shares. This will help to keep total debt levels within the group’s target range, while still providing room for its £2.8bn investment plans over the second half of this decade.”\n\nStory continues\n\nOcado\n\nOcado has been involved in a public spat over payments with its half-owner M&S. Nothing as yet has changed about the relationship so investors are looking for business as usual in Tuesday’s trading update.\n\n“Last year, the division saw revenue rise 7 per cent, as higher prices offset a reduction in the number of items being bought. With grocery inflation tempering, investors will be interested to see how performance has developed,” Sophie Lund-Yates, lead equity analyst at Hargreaves Lansdown, said.\n\n“There will also be a keen eye on active customer numbers. These were up almost 6 per cent last year and are an important barometer for future demand.”\n\nAway from the FTSE 100, two other closely watched results will come from Fevertree Drinks and the FTSE-250 listed cruise operator Carnival.\n\nFevertree has struggled recently, with full-year revenue expected to come in below expectations. The company has flagged difficult trading in Europe, so investors will be focusing on whether its US segment can provide a tonic.\n\nCarnival is hoping strong booking momentum in the final quarter of last year will continue into 2024. The three months to February are typically the quietest period of the year, but investors will get some insight into forward bookings.",
      "article_summary": "In a quiet week for economic announcements, London markets are expecting updates from Kingfisher, Pennon Group, Fevertree, Ocado and Carnival.\nIn a quiet week for economic announcements, London markets are expecting updates from Kingfisher, Fevertree, Ocado and Carnival.\nThe firm cut its full-year pre-tax profit forecast to £560m in November as it forecast tough conditions through the winter.\nNothing as yet has changed about the relationship so investors are looking for business as usual in Tuesday’s trading update.\nThe three months to February are typically the quietest period of the year, but investors will get some insight into forward bookings.",
      "article_keywords": [
         "forward",
         "ahead",
         "week",
         "investors",
         "fevertree",
         "looking",
         "kingfisher",
         "fullyear",
         "ocado",
         "trading",
         "pennon",
         "hargreaves",
         "uk",
         "markets"
      ]
   },
   {
      "article_url": "https://informitv.com/2024/03/19/american-share-of-european-revenues-grows/",
      "article_title": "New Cryptocurrency Releases, Listings & Presales Today – NEURALAI, Venium, WCTrades",
      "article_title_generate": "American share of European revenues grows",
      "article_publisher": "informitv",
      "article_text": "The European audiovisual market was worth €130bn in 2022. The top two markets were Germany and the United Kingdom, respectively worth €25 billion and €24 billion, followed by France at €17 billion, Italy at €10 billion, and Spain at 7 billion. Despite rising revenues from online video subscriptions, the overall sector has declined in revenues in real terms.\n\n\n\nThese are among the many numbers provided in the European Audiovisual Observatory Yearbook of Key Trends.\n\nThe market grew by 5.6% in 2022, after an 8.5% increase in 2021. 60% of the growth arose from the continued boom of online video subscriptions. Given high inflation, there was a decline in sector revenues in real terms.\n\nAmong the top 100 audiovisual players operating in Europe, 60% of revenues in 2022 were banked by European-owned groups. However, the top 3 groups by revenue were from the United States. Ranked by revenue they were Comcast, which owns Sky, then Netflix, which has risen remarkably, followed by Walt Disney.\n\nThe next 4 places were held by RTL, ARD, BBC, and Canal Plus. Public broadcasters accounted for 27% of audiovisual group revenue among the top 100 services.\n\nThe top 10 places, which also included Canal Plus, Warner Bros Discovery, ITV, and ProDSiebenSat.1, accounted for over half of all revenues among the top 100 groups.\n\nWithin the top 20 groups, which account for 73% of revenues, 7 are based in the United States. They include Liberty Global, Paramount, and at number 20 there is Amazon.\n\nTop 20 Audiovisual groups in Europe by revenue in 2022 Rank Group 1 Comcast 2 Netflix 3 Walt Disney 4 RTL 5 ARD 6 BBC 7 Canal Plus 8 Warner Bros. Discovery 9 ITV 10 ProSiebenSat.1 11 Bouygues 12 France Télévisions 13 Vodafone 14 Liberty Global 15 Paramount 16 MediaForEurope 17 Deutsche Telekom 18 RAI 19 ZDF 20 Amazon Source: European Audiovisual Observatory, analysis of data from EBU/MIS, Ampere Analysis, ORBIS and annual reports.\n\nLooking at the global top 50 audiovisual groups by revenue, 23 were based in the United States, with just 13 in Europe, 5 in Japan, and 9 in other countries.\n\nThe Yearbook 2023/2024: Key Trends is available from the European Audiovisual Observatory web site. The full online Yearbook is available by subscription.\n\nwww.obs.coe.int",
      "article_summary": "The European audiovisual market was worth €130bn in 2022.\nDespite rising revenues from online video subscriptions, the overall sector has declined in revenues in real terms.\nThese are among the many numbers provided in the European Audiovisual Observatory Yearbook of Key Trends.\nWithin the top 20 groups, which account for 73% of revenues, 7 are based in the United States.\nThe Yearbook 2023/2024: Key Trends is available from the European Audiovisual Observatory web site.",
      "article_keywords": [
         "european",
         "20",
         "grows",
         "audiovisual",
         "2022",
         "united",
         "american",
         "groups",
         "revenues",
         "yearbook",
         "billion",
         "share",
         "revenue"
      ]
   },
   {
      "article_url": "https://oilprice.com/Finance/the-Economy/Optimism-on-the-Horizon-Positive-Trends-in-the-UK-Economy.html",
      "article_title": "Top Crypto Gainers Today Mar 24 – Conflux, BitTorrent, OKB, Synthetix",
      "article_title_generate": "Optimism on the Horizon: Positive Trends in the UK Economy",
      "article_publisher": "OilPrice.com",
      "article_text": "It was another busy week for the UK economy in which we got fresh data on inflation and another interest rate decision from the Bank of England.\n\nBefore asking where it all leaves the UK economy, its worth a quick recap.\n\nOn Wednesday, inflation fell to 3.4 per cent thanks largely to falling food prices. This was slightly lower than the 3.5 per cent expected by economists. Services inflation also fell, but remained elevated at 6.1 per cent.\n\nBefore the Bank of England met on Thursday, S&P‘s closely watch purchasing managers’ index (PMI) showed the UK economy continued to expand at a “robust” pace in March, albeit at a slightly lower pace than February. However, cost pressures for firms were also still high.\n\nThe big event. As expected the Bank of England left interest rates on hold, but hawkish dissent on the Monetary Policy Committee (MPC) dissipated. The statement said policy would remain restrictive even after rates were cut. A June start date looked increasingly likely after the decision.\n\nFinally a health-check on the UK consumer. Consumer confidence stalled in March, remaining at its February level, while retail sales volumes were flat month-on-month despite a very wet month.\n\nWhat to make of all of this? Whisper it, but things are starting to look fairly good for the UK economy.\n\nThe UK economy, rightly or wrongly, is driven by consumption. With regards to consumption, most economic indicators turned markedly more positive at the start of the year. For example, consumer confidence hit a two-year high in January; retail sales rebounded robustly from a poor December; and the PMI hit a nine-month high in February.\n\nThis week’s surveys suggest that the economy has maintained its early momentum, even if it has not yet been able to take off to a new level.\n\nHowever, this week gives us two very good reasons to think that things will continue getting better.\n\nFirst, inflation. Most economists think inflation will be back to target by April thanks to Ofgem’s energy price cap, although there is some debate about where it will then pick back up again later in the year.\n\nWage growth meanwhile remains fairly hot, even if it too is on a downward trend. If prices continue rising slower at a slower pace than wages, then people will have more money to spend and momentum will continue building.\n\nThis will only support consumer spending.\n\nThe second factor is interest rates. We got our surest signal yet that interest rate cuts are on the way with a June cut now looking more likely than not.\n\nThis has already started feeding through into lower mortgage rates and will continue to do so as the year progresses.\n\nEconomists argued lower inflation and falling interest rates would support consumption in the year ahead.\n\n“We think the stars are aligning for stronger consumer spending growth this year,” Rob Wood, chief UK economist at Pantheon Macroeconomics said.\n\nADVERTISEMENT\n\nSimilarly, Ellie Henderson, UK economist at Investec said “brighter days are ahead for the UK consumer”.\n\nBy Chris Dorrell via CityAM\n\nMore Top Reads From Oilprice.com:",
      "article_summary": "Before asking where it all leaves the UK economy, its worth a quick recap.\nAs expected the Bank of England left interest rates on hold, but hawkish dissent on the Monetary Policy Committee (MPC) dissipated.\nWhisper it, but things are starting to look fairly good for the UK economy.\nThe UK economy, rightly or wrongly, is driven by consumption.\nADVERTISEMENTSimilarly, Ellie Henderson, UK economist at Investec said “brighter days are ahead for the UK consumer”.",
      "article_keywords": [
         "economy",
         "consumer",
         "optimism",
         "continue",
         "interest",
         "horizon",
         "lower",
         "pace",
         "uk",
         "trends",
         "positive",
         "rates",
         "inflation",
         "think"
      ]
   },
   {
      "article_url": "https://bestadvice.co.uk/make-the-most-of-the-market-chatter/",
      "article_title": "5 Best Meme Coins That Might Be The Next Shiba Inu – $MYRO, $SMOG, $SOLAMA, $CCC, $DOGE20",
      "article_title_generate": "Make the most of the market chatter",
      "article_publisher": "BestAdvice",
      "article_text": "As always, the inflation figures followed by the MPC meeting and its resultant Bank Base Rate (BBR) vote, provides us with plenty to delve into, albeit on this occasion without any suggestion of dial-moving changes in terms of housing activity. At least not yet.\n\nThat being said, certainly a drop in inflation, followed by a tangible move in voting patterns from MPC members, does appear to show a much clearer path to a first Bank Base Rate cut, and potentially the much-anticipated increase in consumer confidence that such a move might deliver.\n\nWhile the inflation drop to 3.4% was perhaps more than expected, it still felt like a big step for the MPC to make to then follow that up with a BBR cut, and so it proved, however it’s clear that the noises coming out of the Bank of England – especially with the suggestion that inflation could be at its 2% target in the next few months –were much more ‘cut-friendly’ shall we say.\n\nIndeed, the voting patterns of MPC members appear to prove this. Lest we forget that in February, two members voted for an increase in BBR, while one voted for a cut then, and the other six voted to keep the status quo.\n\nThis month that had moved quite noticeably, with the two members who had previously thought a further rise was necessary now falling into the ‘hold’ camp, while we still had one member looking for that early cut.\n\nNow, on the surface, that might not seem like a big deal, but the fact this change of heart had happened within six weeks or so is definitely worthy of note, and with the Governor, Andrew Bailey, using the MPC meeting to talk up the prospects of a rate cut in the not too distant future, I think we move much closer to this. Especially if inflation does get closer and closer to target.\n\nWhat should perhaps also be factored into this situation, is that we now wait almost two months before the next MPC meeting, which will not take place until the 9th May.\n\nInterestingly, this is after the Local Elections, and what price a rate cut then which might foreseeably help the Conservative government distract from what many political commentators believe will be a damaging set of results?\n\nOf course the Bank is independent of this, but as mentioned, if we have seen further falls in inflation, and with Bailey saying explicitly that the MPC doesn’t necessarily need to see it at 2% before it cuts, then we could have that first drop in May. Or perhaps June.\n\nCertainly, the markets are anticipating two to three cuts in BBR this year, and while swaps have been up and down lately, when we get tangible proof of that, then the mortgage market should see the benefits in terms of product pricing, albeit with the caveat that we shouldn’t expect big drops in mortgage rates.\n\nThis, of course, is a market that thrives on confidence and, dare I say it, lower rates. We all saw the impact of this in December/January and February when lenders were able to cut pricing, and this acted as a catalyst for greater demand in both the purchase and remortgage spaces.\n\nIn lieu of anything game-changing from the Budget, it is likely to be rates that do most of the heavy-lifting within the mortgage market over the course of 2024, and from that perspective, advisers should not be backward in coming forward in marketing these to both new and existing clients.\n\nFew mortgage borrowers are uninterested in the cost of their mortgage, especially if they are coming to the end of the deal, and they are anticipating a big increase in monthly costs. If you’re able to find them a pathway to less of an increase, all well and good, but borrowers need to be told about this and they need to know that their best chance of this is via you, not direct.\n\nAs we know the PT route might be right for some borrowers – as we saw last year it might be the only option they have – but increasingly, and with rates coming off last year’s highs, a remortgage might now be more suitable. And, with those remortgages, comes opportunities that simply do not exist in the PT space for advisers, not least ancillary sales generated by other customer needs including protection, GI, conveyancing, and the like.\n\nIn that sense, I would make the most of market chatter. Clearly, we’ve not seen BBR cuts yet, but they look inevitable. Get ahead of this in the mind of your clients and make sure they know exactly where they need to go in order to make the most of what should be more competitive options for them in the months to come.\n\nKeith Young is managing director of Broker Conveyancing",
      "article_summary": "Indeed, the voting patterns of MPC members appear to prove this.\nInterestingly, this is after the Local Elections, and what price a rate cut then which might foreseeably help the Conservative government distract from what many political commentators believe will be a damaging set of results?\nThis, of course, is a market that thrives on confidence and, dare I say it, lower rates.\nIn lieu of anything game-changing from the Budget, it is likely to be rates that do most of the heavy-lifting within the mortgage market over the course of 2024, and from that perspective, advisers should not be backward in coming forward in marketing these to both new and existing clients.\nIn that sense, I would make the most of market chatter.",
      "article_keywords": [
         "increase",
         "members",
         "mortgage",
         "cut",
         "rate",
         "need",
         "chatter",
         "mpc",
         "bbr",
         "inflation",
         "market"
      ]
   },
   {
      "article_url": "https://aviationsourcenews.com/airport/caa-proposes-heathrow-charge-changes/",
      "article_title": "Why reading beyond the headlines is crucial for 100% mortgages",
      "article_title_generate": "CAA Proposes London Heathrow Charge Changes",
      "article_publisher": "AviationSource",
      "article_text": "In the last week the UK Civil Aviation Authority (CAA), has published its proposed Heathrow Airport charge changes.\n\nThis article will cover the details surrounding the CAAs charge changes for London Heathrow Airport (LHR) and what this means for the airport.\n\nCAA: Heathrow Charge Adjustments\n\nPhoto Credit: Konstantin Von Wedelstaedt (GFDL 1.2 http://www.gnu.org/licenses/old-licenses/fdl-1.2.html or GFDL 1.2 http://www.gnu.org/licenses/old-licenses/fdl-1.2.html), via Wikimedia Commons\n\nThe CAAs final decision on the price cap back in March 2023 shown that the price per passenger would be capped at the following – £25.43 in 2024, £25.24 in 2025, and £25.28 in 2026.\n\nSince, the CAA has addressed the CMAs (Competition and Markets Authority) determination on the authorities H7 licence adjustments appeal.\n\nThe CMAs appeal found that the CAA was in broadly the right range for the price caps. However, there were some smaller issues that needed to be re-examined.\n\nThe H7 licence period runs between January 2022 until December 2026.\n\nFurther H7 Adjustments\n\nLooking through the CMAs appeal, the regulator has made further adjustments to its H7 licence, including the following –\n\nThrough additional corrections, the difference between Heathrow Airport’s actual and allowed revenues in both 2020 and 2021. They will further reduce the airport charges in both 2025 and 2026.\n\nRe-examining the inclusion of a premium for index-linked debt in Heathrow Airport’s overall weighted average cost of capital, will be removed completely.\n\nEnsuring Heathrow Airport neither loses nor gains from matters that are beyond its control with regards to pension deficit repair costs and business rates.\n\nThe CAA will now enter into a six week consultation over these proposed changes with the CMA.\n\nIf these changes come into effect, 2025 price cap will drop by £1.52 and the 2026 price cap will drop by £1.58. This will then see 2025 charges at £23.72 and 2026 charges at £23.70.\n\nOverall\n\nFinally, these further price cap reductions will not only help keep fare prices for travelling passengers at more affordable levels. But also, this will help incentivise more investment into the UK capital airport, which it certainly needs.\n\nMaybe these changes may also help investors and the public with spurring the expansions plans for the airport as it struggles to cope with the constant increase in demand across all reaches of the globe.\n\nRecent CAA News…\n\nIn recent news, the CAA has been up to the following –\n\nAn interim report, prepared by an Independent Review Panel into the air traffic control failure on 28 August 2023, has been published by the CAA. Read our article here.\n\nWizz Air has is now fully compliant with the deed of undertaking signed with the CAA last year following disruptions to its service in the summer of 2022. Read our article here.\n\nYoung people aged 18 to 34 years old are leading aviation’s revival compared to other age groups according to a new consumer trends report from the CAA. Read our article here.\n\nDid you know AviationSource has two newsletters? One covers the general news and analysis of the industry as a whole, and the other to do with emergencies that take place throughout the year! To subscribe to our General News Newsletter, CLICK HERE!\n\nTo subscribe to our Emergencies, Accidents & Incidents Newsletter, CLICK HERE!\n\nClick the photo to join our WhatsApp channel so then you can stay up to date with everything going on in the aviation industry!",
      "article_summary": "In the last week the UK Civil Aviation Authority (CAA), has published its proposed Heathrow Airport charge changes.\nThis article will cover the details surrounding the CAAs charge changes for London Heathrow Airport (LHR) and what this means for the airport.\nEnsuring Heathrow Airport neither loses nor gains from matters that are beyond its control with regards to pension deficit repair costs and business rates.\nIf these changes come into effect, 2025 price cap will drop by £1.52 and the 2026 price cap will drop by £1.58.\nOverallFinally, these further price cap reductions will not only help keep fare prices for travelling passengers at more affordable levels.",
      "article_keywords": [
         "changes",
         "airport",
         "caa",
         "price",
         "following",
         "heathrow",
         "london",
         "2025",
         "cap",
         "proposes",
         "charge",
         "h7",
         "article"
      ]
   },
   {
      "article_url": "https://bestadvice.co.uk/why-reading-beyond-the-headlines-is-crucial-for-100-mortgages/",
      "article_title": "A missed opportunity and 2024 property market expectations",
      "article_title_generate": "Why reading beyond the headlines is crucial for 100% mortgages",
      "article_publisher": "BestAdvice",
      "article_text": "Rumours that Chancellor Jeremy Hunt planned to introduce a 99% LTV mortgage designed to help first-time buyers (FTBs) get a foot on the property ladder in the Spring Budget dominated headlines last month.\n\nWhile the finer details of the supposed government-backed policy were rather scant, the news sparked a significant level of debate and criticism among commentators over its legitimacy but the idea was scrapped as quickly as it had apparently been conceived.\n\nOne of the major objections to the proposed scheme was that having a smaller deposit risked leaving buyers in negative equity if house prices were to drop significantly in the future.\n\nAnother concern was that, although it would ease the pressure on FTBs when saving for a deposit, it would not make the cost of buying a property any more affordable, especially in the higher interest rate environment.\n\nGiven the fact that the concept of a 99% mortgage was not too far removed from a product that already exists in the market – the 100% mortgage – the furore and attention surrounding the proposed scheme came as somewhat of a surprise.\n\nAlongside many other lenders, we have been offering 100% mortgage products for quite some time, therefore, a government-backed 99% mortgage product did not seem such an unusual concept.\n\nWhile it is certainly true that 100% mortgages have come under a fair amount of criticism over the years, this type of lending solution can offer a perfectly viable alternative for those borrowers who are looking to get onto the property ladder but are struggling to raise a deposit.\n\nThere are many different variations of this type of mortgage in the market today and understanding what they are and how they work is important when addressing the needs of a variety of clients.\n\nFor example, here at The Loughborough, we have a suite of family assist mortgage solutions including a family deposit product which enables the borrower to take out a 100% LTV mortgage and have another family member (typically parents) guarantee a deposit of up to 20% of the purchase price.\n\nThis can be done by placing a collateral charge against the depositor’s own property or as a cash lump sum into a savings account offering a 3% interest rate. In both scenarios, the deposit is released after seven years, or sooner if there is enough equity in the property when it is time to remortgage.\n\nThis can prove to be an attractive solution for parents and family members in the current higher interest rate environment where gifting a deposit may no longer be financially viable. Instead, a family assist mortgage not only means they will get their money back; they will also earn interest on their money while still helping their child buy a house.\n\nA similar proposition is available through our Joint Borrower Sole Proprietor (JBSP) Deposit Guarantee product which enables a family member to provide a 20% security against their house or as cash held in a deposit guarantee account, while also boosting the applicant’s borrowing capacity by using family members’ income for affordability purposes.\n\nAgain, in most cases, this tends to be the borrower’s parents, but other family members such as grandparents, siblings and aunts and uncles can also be listed on the application, although the property will only be legally owned by the occupier.\n\nAs with all forms of borrowing, there will always be an element of risk involved and family members should ensure they seek legal advice to understand what would happen if the borrower failed to keep up with mortgage payments.\n\nGiven the level of complexity involved in these applications, it is important to note that each one is individually assessed and underwritten to ensure maximum affordability for the client. This also enables brokers to get answers to any questions they may have regarding the application process.\n\nNot only does this help to provide surety of service and outcome, it also allows brokers to help their clients explore every avenue of getting on the property ladder and achieve their homeownership aspirations in an innovative yet responsible manner.\n\nAshley Pearson is head of intermediaries at Loughborough Building Society",
      "article_summary": "Given the fact that the concept of a 99% mortgage was not too far removed from a product that already exists in the market – the 100% mortgage – the furore and attention surrounding the proposed scheme came as somewhat of a surprise.\nAlongside many other lenders, we have been offering 100% mortgage products for quite some time, therefore, a government-backed 99% mortgage product did not seem such an unusual concept.\nThis can be done by placing a collateral charge against the depositor’s own property or as a cash lump sum into a savings account offering a 3% interest rate.\nThis can prove to be an attractive solution for parents and family members in the current higher interest rate environment where gifting a deposit may no longer be financially viable.\nThis also enables brokers to get answers to any questions they may have regarding the application process.",
      "article_keywords": [
         "members",
         "reading",
         "headlines",
         "deposit",
         "mortgage",
         "family",
         "property",
         "interest",
         "rate",
         "mortgages",
         "100",
         "parents",
         "product",
         "crucial"
      ]
   },
   {
      "article_url": "https://bestadvice.co.uk/a-missed-opportunity-and-2024-property-market-expectations/",
      "article_title": "Bluestone Mortgages makes sales team appointments",
      "article_title_generate": "A missed opportunity and 2024 property market expectations",
      "article_publisher": "BestAdvice",
      "article_text": "It’s been evident over the past 12 to 18 months that first-time buyers have found it increasingly tough from an affordability perspective during such turbulent economic times and amidst rising cost of living pressures. While this may have been a disheartening period for many, the major positive to take from this is that demand remains strong amongst this vital band of borrowers.\n\nAlthough, it’s also fair to say that all parties involved in the homebuying process continue to require additional assistance when it comes to opening more doors for first-time buyers and in helping to bridge a cavernous supply gap which continues to widen.\n\nOn this very subject, a poll in our Game Changer webinar series which took place at the beginning of February revealed that over a third of property professionals were looking towards the reintroduction of Help To Buy or some government-led initiative announcement in the then upcoming Budget to help boost the new build sector and first-time buyer marketplace.\n\nBreaking down the responses to the question – what do you most want to see from the Chancellor in March’s Budget, 35% of respondents replied with Help To Buy or something to support new build and first-time buyers. 22% sought a stamp duty holiday/reduction, 17% opted for an inheritance tax cut, 16% chose stamp duty changes for downsizers and 10% elected for additional landlord support.\n\nWe are now on the other side of this important political landmark and while expectations were not exactly unbridled, the phrase ‘missed opportunity’ has emerged as the most common reaction amongst many industry commentators and left these respondents a little deflated.\n\nThankfully, the housing and mortgage markets are proving to be highly resilient entities and we should certainly take great comfort and confidence from this fact moving forward.\n\nWhen evaluating the 2024 UK property market, 41% of the webinar respondents suggested that there was cause for optimism, with the same proportion saying that there is ‘possibly’ cause for optimism. 13% stated that they were ‘unsure’ about the marketplace with 5% saying that there was ‘probably not’ any cause for optimism. However, on a brighter note, not one property professional in the audience suggested a definite ‘no’ cause for optimism for the UK property market over the next 12 months.\n\nThe 2024 property market will undoubtedly see a rise in the value attached to expertise throughout the industry. Leading professionals in their fields such as estate agents, surveyors, conveyancers and mortgage intermediaries will play an even more integral role in ensuring that the ongoing needs of FTBs, second steppers, downsizers, landlords and investors are being successfully met, with the highest service standards being duly rewarded.\n\nAnd let’s hope this vast knowledge base is utilised to improve a somewhat cumbersome homebuying journey and deliver a Spring bounce which can help further propel this optimism to new levels and build on what has been a solid start to the year from an enquiry and transactional standpoint.\n\nMatthew Cumber is managing director of Countrywide Surveying Services",
      "article_summary": "It’s been evident over the past 12 to 18 months that first-time buyers have found it increasingly tough from an affordability perspective during such turbulent economic times and amidst rising cost of living pressures.\nWhen evaluating the 2024 UK property market, 41% of the webinar respondents suggested that there was cause for optimism, with the same proportion saying that there is ‘possibly’ cause for optimism.\n13% stated that they were ‘unsure’ about the marketplace with 5% saying that there was ‘probably not’ any cause for optimism.\nHowever, on a brighter note, not one property professional in the audience suggested a definite ‘no’ cause for optimism for the UK property market over the next 12 months.\nThe 2024 property market will undoubtedly see a rise in the value attached to expertise throughout the industry.",
      "article_keywords": [
         "2024",
         "respondents",
         "optimism",
         "build",
         "property",
         "help",
         "webinar",
         "buyers",
         "cause",
         "missed",
         "market",
         "expectations",
         "opportunity",
         "firsttime"
      ]
   },
   {
      "article_url": "https://bestadvice.co.uk/bluestone-mortgages-makes-sales-team-appointments/",
      "article_title": "From Memes to Mainstream: FLOKI, PEPE, and Furrever Token Revolutionizing Cryptocurrency",
      "article_title_generate": "Bluestone Mortgages makes sales team appointments",
      "article_publisher": "BestAdvice",
      "article_text": "Bluestone Mortgages has announced the revision of its sales team with the addition of Ben Curran as business development manager (BDM) and the promotions of Kelly Powell and Nik Sukara to Field BDMs.\n\nThese appointments and promotions are part of the specialist lender’s commitment to better support brokers and customers with adverse credit across the country.\n\nCurran has joined Bluestone as BDM overseeing and managing broker relationships in the South West of England and Wales. Prior to this, he worked in the sales team of Liberty, a specialist lender in Australia.\n\nPowell has been promoted to field BDM covering London, while Sukara will cover the North West and Yorkshire. Both will be responsible for promoting and developing awareness of Bluestone’s products and business proposition in their respective markets.\n\nThis new hire and promotions follow the recent appointments of Steve Bailey as the South East of England’s field-based BDM, and Phil Quinn as national account manager.\n\nMark Hollands, head of sales and distribution, Bluestone Mortgages, said: “We are delighted to have Ben join our team as business development manager and help strengthen our team in the South West of England and Wales.\n\n“We are also pleased to promote both Kelly and Nik, who have played pivotal roles in expanding our proposition in their markets.\n\n“This new appointment and promotions support our ultimate mission as a specialist lender to ensure that everyone has an opportunity to climb onto or up the property ladder and make their homeownership dream come true.”",
      "article_summary": "Bluestone Mortgages has announced the revision of its sales team with the addition of Ben Curran as business development manager (BDM) and the promotions of Kelly Powell and Nik Sukara to Field BDMs.\nThese appointments and promotions are part of the specialist lender’s commitment to better support brokers and customers with adverse credit across the country.\nCurran has joined Bluestone as BDM overseeing and managing broker relationships in the South West of England and Wales.\nPrior to this, he worked in the sales team of Liberty, a specialist lender in Australia.\nMark Hollands, head of sales and distribution, Bluestone Mortgages, said: “We are delighted to have Ben join our team as business development manager and help strengthen our team in the South West of England and Wales.",
      "article_keywords": [
         "appointments",
         "promotions",
         "bluestone",
         "team",
         "business",
         "makes",
         "mortgages",
         "south",
         "sales",
         "bdm",
         "specialist",
         "west",
         "support"
      ]
   },
   {
      "article_url": "https://timestabloid.com/from-memes-to-mainstream-floki-pepe-and-furrever-token-revolutionizing-cryptocurrency/",
      "article_title": "Self-employed enquiries outpacing ones from FTBs",
      "article_title_generate": "From Memes to Mainstream: FLOKI, PEPE, and Furrever Token Revolutionizing Cryptocurrency",
      "article_publisher": "Times Tabloid",
      "article_text": "In the ever-evolving landscape of cryptocurrencies, meme coins have carved out a unique niche, captivating investors with their whimsical appeal and community-driven ethos. Among the notable contenders in this space are FLOKI, PEPE, and Furrever Token (FURR), each offering its own brand of charm and potential for growth. While FLOKI and PEPE have already gained traction as successful meme coins, Furrever Token (FURR) is emerging as a promising contender, poised to make waves on the Binance Smart Chain (BSC) following in the footsteps of PEPE’s success. As meme coins continue to capture the imagination of crypto enthusiasts worldwide, the stage is set for FURR to shine as the next big thing in the meme coin arena.\n\nFLOKI (FLOKI) Shows Signs of Recovery: Plans for Regulated Digital Banking Account Spark Optimism\n\nFLOKI (FLOKI) is currently priced at around $0.0002316, marking an increase of over 2.5% since yesterday. This uptick in price has generated optimism among investors, signaling potential recovery in the FLOKI market. Adding to this positive sentiment is a recent announcement from the project’s lead developer, B, revealing plans for a groundbreaking initiative. It has been disclosed that the FLOKI community is exploring the possibility of introducing a regulated digital banking account, allowing users to fund their accounts with (FLOKI) tokens denominated in dollars, euros, and pounds sterling. This innovative approach not only enhances the utility of FLOKI but also expands its use case into the realm of traditional banking services. As the project continues to push boundaries and explore new avenues for adoption, investors are increasingly bullish on FLOKI’s future prospects.\n\nPepe (PEPE) Whales Make Massive Purchases: Significant Market Movement Detected\n\nPepe (PEPE) is currently priced at about $0.000007566, showing a decline of over 8% in the past week. Despite this, significant attention has been drawn to the meme coin due to two notable investments made by influential investors, often referred to as “whales.” These investors have collectively acquired a massive 560.2 billion PEPE coins, sparking discussions and speculation within the cryptocurrency community.\n\nSpot On Chain, a leading cryptocurrency analytics platform, has highlighted these substantial purchases, which coincide with a significant 11% price increase in PEPE over the last 24 hours. The acquisitions by the whales come amidst a rebound in PEPE’s price following a recent crash in the crypto market, suggesting a strategic maneuver to capitalize on market volatility.\n\nThe first investor, identified by their blockchain address as 0xd93, made a significant investment of $3.86 million, diversifying between 3.67 million USDC and 300 WTAO. This individual has previously realized substantial profits from PEPE trading, showcasing their proficiency in navigating the volatile market. On the other hand, the second investor, known as 0x522, pursued a different strategy, exchanging 42.08 billion Shiba Inu (SHIB) and 64 Ethereum (ETH) valued at $1.12 million and $224,000, respectively, for 100 billion PEPE coins. This transaction was facilitated through Binance, underscoring the widespread reach of PEPE trading activities.\n\nFurrever Token (FURR) Continues to Shine Amidst Market Downturn with Up to 15X Returns\n\nDespite the prevailing market downturn, Furrever Token (FURR) stands out as a beacon of positivity, captivating investors with its unique charm and promising trajectory. Designed to revolutionize the crypto space with an infusion of cuteness, FURR offers users a delightful and charming experience unlike any other. In a landscape dominated by serious blockchain projects, Furrever Token brings a breath of fresh air with its lighthearted approach to crypto. The project’s mission is clear: to create a whimsical and heartwarming crypto ecosystem centered around the universal appeal of cute kitties. With a focus on fostering a warm and friendly community that shares a love for the lighter side of crypto, Furrever Token aims to provide users with an unforgettable experience that combines fun and functionality.\n\nLaunching on the BNB-20 blockchain, FURR boasts a total token supply of around 9 billion, with 65% of tokens available during the presale. This presale has proven to be immensely popular, with Furrever Token already raising over $430,000 and nearing completion of stage 4 out of 10. Despite the market challenges, FURR’s presale success highlights the unwavering enthusiasm of investors for the project’s vision and tokenomics. With a fundraising goal of $1 million, Furrever Token is well on its way to achieving its targets, setting the stage for a successful launch on decentralized exchanges like PancakeSwap.\n\nWith a current price of $0.000312 and the potential for significant returns of up to 15X, Furrever Token presents an enticing investment opportunity amidst the market turbulence. Accepting a variety of payment options like USDT (BEP-20), FURR ensures accessibility for a diverse range of investors while prioritizing security and compliance through rigorous audits and safety measures. As Furrever Token continues to gain momentum and approach its presale goals, it exemplifies the resilience and potential for growth inherent in innovative cryptocurrency projects.\n\nDiscover the Most Exclusive Presale Opportunity of 2024 Now:\n\n<\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\nJoin Official Telegram Group | Follow Official X Account",
      "article_summary": "Among the notable contenders in this space are FLOKI, PEPE, and Furrever Token (FURR), each offering its own brand of charm and potential for growth.\nFLOKI (FLOKI) Shows Signs of Recovery: Plans for Regulated Digital Banking Account Spark OptimismFLOKI (FLOKI) is currently priced at around $0.0002316, marking an increase of over 2.5% since yesterday.\nPepe (PEPE) Whales Make Massive Purchases: Significant Market Movement DetectedPepe (PEPE) is currently priced at about $0.000007566, showing a decline of over 8% in the past week.\nFurrever Token (FURR) Continues to Shine Amidst Market Downturn with Up to 15X ReturnsDespite the prevailing market downturn, Furrever Token (FURR) stands out as a beacon of positivity, captivating investors with its unique charm and promising trajectory.\nDiscover the Most Exclusive Presale Opportunity of 2024 Now:<Furrever Token Official Website | Visit Furrever Token PresaleJoin Official Telegram Group | Follow Official X Account",
      "article_keywords": [
         "mainstream",
         "crypto",
         "memes",
         "furrever",
         "cryptocurrency",
         "investors",
         "revolutionizing",
         "significant",
         "floki",
         "presale",
         "token",
         "market",
         "furr",
         "pepe"
      ]
   },
   {
      "article_url": "https://bestadvice.co.uk/self-employed-enquiries-outpacing-ones-from-ftbs/",
      "article_title": "SmartSearch secures investment to match growth plans",
      "article_title_generate": "Self-employed enquiries outpacing ones from FTBs",
      "article_publisher": "BestAdvice",
      "article_text": "A survey of mortgage brokers carried out by the Family Building Society has found that the number of mortgage enquiries from the self-employed are outpacing those from first-time buyers.\n\nThe research found that while demand from landlords for buy-to-let loans is still healthy, enquiries are less than those from the former two groups.\n\nWhen it comes to finding lenders to place these groups with, the hardest to do so are buy-to-let clients followed by those seeking interest only mortgages and the self-employed, who are on equal footing when it comes to finding willing lenders.\n\nThe survey also showed that brokers feel the interest-only market is the most underserved by lenders. Despite that, the belief is that mortgage business will increase, and house prices will remain stable during the year.\n\nKeith Barber, director of business development at Family Building Society, said: “While there is clearly still a healthy demand for mortgages, the survey shows that the needs of these significant groups of borrowers are not being met by lenders overall.\n\n“Often with more complex circumstances, lenders need to take the time and trouble to listen to their complicated stories. With individual underwriting and consideration, it’s something we can do well.”",
      "article_summary": "A survey of mortgage brokers carried out by the Family Building Society has found that the number of mortgage enquiries from the self-employed are outpacing those from first-time buyers.\nThe research found that while demand from landlords for buy-to-let loans is still healthy, enquiries are less than those from the former two groups.\nThe survey also showed that brokers feel the interest-only market is the most underserved by lenders.\nDespite that, the belief is that mortgage business will increase, and house prices will remain stable during the year.\n“Often with more complex circumstances, lenders need to take the time and trouble to listen to their complicated stories.",
      "article_keywords": [
         "healthy",
         "mortgage",
         "family",
         "ones",
         "outpacing",
         "selfemployed",
         "groups",
         "survey",
         "society",
         "mortgages",
         "ftbs",
         "enquiries",
         "lenders",
         "finding"
      ]
   },
   {
      "article_url": "https://bestadvice.co.uk/smartsearch-secures-investment-to-match-growth-plans/",
      "article_title": "Urgent Invitation To Listen: Storytelling For A More Equitable World",
      "article_title_generate": "SmartSearch secures investment to match growth plans",
      "article_publisher": "BestAdvice",
      "article_text": "SmartSearch, a UK provider of digital compliance and anti-money laundering (AML) software, has signed an agreement to receive a significant equity investment from Triple Private Equity.\n\nWith its investment, Triple will now take a majority share in the business and will work alongside the existing management to deliver on the company’s next stage of growth, with SmartSearch founders and existing shareholders also retaining a minority in the company.\n\nFounded in 2011, SmartSearch’s platform and technology enables firms to navigate ever-increasing regulatory demands including AML compliance, customer due diligence, Know Your Customer (KYC) and Know Your Business (KYB) procedures.\n\nIt is used by more than 7,000 client firms and 60,000 users in a range of regulated markets including legal, accountancy, property and financial services. Its customer base includes over 1,000 property firms, one in two of the top 100 accountancy firms and one in three of the top 200 legal firms.\n\nTo support both its core markets and continued expansion among enterprise clients, SmartSearch launched its new platform last year. This continued investment has delivered around 20% annual growth between 2020 and 2023.\n\nGuy Harrison, CEO of SmartSearch, said: “Triple are an excellent match for SmartSearch in its ambitious next phase of growth. The business is especially looking forward to calling on their deep expertise in scaling mission critical, B2B risk and compliance software.”\n\nMartin Cheek (pictured), co-founder and managing director of SmartSearch, added: “Having founded the business with John Dobson, I am incredibly proud of what we have built at SmartSearch, the world class technology we have developed and the talented team we have created. In a little more than a decade, SmartSearch has grown from a Regtech start-up, to a trailblazing technology company that is driving the digital compliance revolution. This major investment from Triple is a true testament to the hard work of our nearly 200-strong team who, alongside Triple, will be instrumental in this next stage of growth.”\n\nMads Hansen, head of investments and managing & founding partner at Triple, concluded: “We are pleased to announce Triple Private Equity’s first investment in SmartSearch. SmartSearch is a market leader in GRC in the UK, a key investment space for Triple. The company has shown consistent growth and profitability and provides a high-quality software platform for its clients. We look forward to partnering with the SmartSearch team to pursue the company’s next stage of growth.”",
      "article_summary": "SmartSearch, a UK provider of digital compliance and anti-money laundering (AML) software, has signed an agreement to receive a significant equity investment from Triple Private Equity.\nThis continued investment has delivered around 20% annual growth between 2020 and 2023.\nGuy Harrison, CEO of SmartSearch, said: “Triple are an excellent match for SmartSearch in its ambitious next phase of growth.\nSmartSearch is a market leader in GRC in the UK, a key investment space for Triple.\nWe look forward to partnering with the SmartSearch team to pursue the company’s next stage of growth.”",
      "article_keywords": [
         "smartsearch",
         "investment",
         "firms",
         "team",
         "business",
         "secures",
         "compliance",
         "technology",
         "plans",
         "match",
         "triple",
         "stage",
         "growth"
      ]
   },
   {
      "article_url": "https://www.taxresearch.org.uk/Blog/2024/03/24/will-huttons-praise-for-rachel-reeves-mais-lecture-is-itself-a-pretty-depressing-foretaste-of-the-disaster-that-labour-will-be/",
      "article_title": "3 best Solana tokens to invest in 2024",
      "article_title_generate": "Will Hutton’s praise for Rachel Reeves’ Mais lecture is itself a pretty depressing foretaste of the disaster that Labour will be.",
      "article_publisher": "Tax Research UK",
      "article_text": "Like many, I was confused by Will Hutton's arguments in The Observer today, in which he argued that Rachael Reeves has given Britain “the plan for economic lift off”. Unsurprisingly, I disagree with him.\n\nLet me summarise my argument at the outset. I think Will Hutton is looking for a job. I cannot explain what he is saying in any other way.\n\nThen let me move to the detail. Will is arguing, as I can see it, three things.\n\nFirst, his suggestion is that those who have tried to impose policy on the economy have always got things wrong. He quotes Polanyi, who he interprets as saying that it was the imposition of centrally dictated policy that gave rise to the extremist backlashes of the 1930s. As a result, he seems to be applauding her for backing away from that central planning. Doing so, he ignores his own past demands, and what most would think to be the critical economic social democratic role of any government, which is to constrain the errors, excesses and inappropriate directions of market economics. Perhaps he is, however, revealing that he really has been a disciple of Hayek all along, whilst also revealing that he thinks she is. I really can't work out what else he is trying to say.\n\nThen, entirely paradoxically, he endorses her claim that this is an inflection point where what he describes as “a new productivist economic paradigm is emerging” which he argues is “vital for economic growth and social cohesion through higher public investment, an active industrial policy and quality public services.” Anyone who can reconcile this second argument with his first, noted above, deserves a prize.\n\nThird, he then argues that adopting Jeremy Hunt's fiscal rules, as she is, will not in any way constrain her ambition to deliver this plan for growth. His reasons for saying so are, as far as I can work out, twofold. First, he seems to suggest that the rule is just for show because the figures can always be fudged to make it work. This might be a frank recognition of reality, but it does not constitute either a fiscal plan, or economic sense. Then, the paradox continues, because having firstly condemned central planning, and then praised it, he then seeks to reconcile his positions and the use of this fiscal rule by suggesting that the job of government will, in Rachael Reeves opinion, be to direct the way in which private capital will be invested, because the government is not going to make any available. In that way the fiscal rule is upheld but the desired growth is delivered in accordance with a plan for which Reeves can then take credit. Quite why he thinks that this might be possible he does not say, because very obviously Rachael Reeves does not know either, if that is what she really thinks.\n\nBut then, there's a great deal that Rachael Reeves does not know or say. She does not say how she will tackle poverty. Nor has she got a plan to save local government. The NHS can only be presumed to be up for sale. There is no money for education. Devolution, as ever, got no proper mention from Reeves. And apparently, all this can be ignored because the right wing press would criticise Reeves if she did discuss such issues, so Will Hutton thinks she need not do so.\n\nI am sure, as I mentioned at the outset, that Will Hutton had a reason for writing this article, but the piece is itself profoundly confused in an attempt to endorse Reeves' own incoherence. If this is indication of the current level of centre-right thinking around Reeves (where she, herself, is located on the political spectrum) it is a pretty depressing foretaste of the disaster that Labour will be.",
      "article_summary": "Like many, I was confused by Will Hutton's arguments in The Observer today, in which he argued that Rachael Reeves has given Britain “the plan for economic lift off”.\nThis might be a frank recognition of reality, but it does not constitute either a fiscal plan, or economic sense.\nQuite why he thinks that this might be possible he does not say, because very obviously Rachael Reeves does not know either, if that is what she really thinks.\nBut then, there's a great deal that Rachael Reeves does not know or say.\nIf this is indication of the current level of centre-right thinking around Reeves (where she, herself, is located on the political spectrum) it is a pretty depressing foretaste of the disaster that Labour will be.",
      "article_keywords": [
         "economic",
         "pretty",
         "rachel",
         "work",
         "huttons",
         "reeves",
         "does",
         "saying",
         "praise",
         "fiscal",
         "mais",
         "lecture",
         "thinks",
         "labour",
         "disaster",
         "foretaste",
         "rachael",
         "way",
         "plan"
      ]
   }
]